[{"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 5202948, "Review Title": "NOT GIVEN", "Review Content": "For over 16 years and across three different employers, CDW has come along with me to provide assistance.  I lean on them to provide resources and knowledge in a world where no one person can know everything.  Without them, I would be lost!\n\n\nHaving a sales rep that I can contact directly with any question.  That person in turn can navigate the web of contacts to figure out a solution or present several different options.\n\n\nSometimes the offerings of CDW can be confusing.  Vendor relationships change, and there will be no notice outside the organization.\n\n\nAll of our cloud-based solutions are managed via CDW.  This lowers costs due to bulk pricing while providing better services for support.", "Publish Date": "2023-09-12", "Author": "Shawn C."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 8592966, "Review Title": "NOT GIVEN", "Review Content": "High Quality. No Breakdowns. Easy return or replacement\n\n\nLong lead times for some of the brands from different vendors\n\n\nGo for it.\n\n\nSupply Chain Disruption. Better Delivery", "Publish Date": "2023-09-11", "Author": "NOT GIVEN"}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 5030756, "Review Title": "NOT GIVEN", "Review Content": "Good service provider\n\n\nOnline cloud support and provide Microsoft license on time.\n\n\nSome license ordered via adobe, not delivered on time on CDW site.\n\n\nMicrosoft Office 365 licenses, ADP and Azure\n\n\nOnline cloud support and provide Microsoft license on time.", "Publish Date": "2023-08-07", "Author": "NOT GIVEN"}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 4241037, "Review Title": "NOT GIVEN", "Review Content": "Whenever asking for quotes, looking for specific items, CDW always communicates and gives us great support.\n\n\nGreat service! Speedy order times! Great prices.\n\n\nLack of communication or follow-up at times.\n\n\nCDW always helps us when we have strict deadlines and need items right away.", "Publish Date": "2021-10-18", "Author": "Bryant C."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 4727950, "Review Title": "NOT GIVEN", "Review Content": "I was searching for home-office options with regards to monitors and docking stations, multiple moitor setups. CDW provided me with great information, tips, links that helped me decide on both the monitors and docking station that would best suit my needs going forward.\n\n\nThe product reviews and recommendations are extremely detailed and thorough\n\n\nNo services were procured or utilized by me\n\n\nKeep an open mind, explore multiple products and reviews...make informed decisions based upon needs, cost and compatibility\n\n\nSolved the display issue, clear and concise reviews and reporting", "Publish Date": "2021-05-07", "Author": "NOT GIVEN"}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 4713903, "Review Title": "NOT GIVEN", "Review Content": "Ramping up of a data center project with financial support\n\n\nCustomer centric, able to provide advice beyond regular sales intention\n\n\nInitial cost and recurrent cost of training\n\n\nRequest individual solution for your business needs as CDW is perfectly capable and suitable to find the best solution for your business\n\n\nEstablishing new data center with improved security adapted to future roll-outs", "Publish Date": "2021-04-30", "Author": "NOT GIVEN"}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 4324267, "Review Title": "NOT GIVEN", "Review Content": "networking hardware, support, and license, Microsoft, Adobe, Dell, WatchGuard, Ruckus and all our software licenses are dealt with CDW\n\n\nCDW is great to deal with a wide variety of software/hardware licenses in the market. they sell products of all major software and hardware products in the world.\n\n\nNo cons. Service delivery is fabulous. CDW deals with almost all software licensing and hardware vendors. At times my account manager delays with their followup. It could be a personal experience.\n\n\nGreat vendor to deal with for your software and hardware requirements.\nThey have a great team working with multiple vendors and help you achieve your software requirements.\nAs a decision-maker in my organization, I would highly recommend CDW and looking forward to working with them in my future organizations as well.\nif you are looking at a multivendor point of contact, CDW is the best in Canada.\n\n\nall our software, hardware, and licensing needs are dealt with by CDW. It is great to have a single vendor point of contact for all your software and hardware requirements.", "Publish Date": "2020-08-10", "Author": "renford r."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 4719151, "Review Title": "NOT GIVEN", "Review Content": "Managed Services\n\n\nNo extensive coding, real time data transfer, automation options\n\n\nThe service support and product timelines have been declining .\n\n\nKeep an eye on the services not as earlier.\n\n\nExpensive coding, dual entry, no real time delivery, etc", "Publish Date": "2021-05-04", "Author": "NOT GIVEN"}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 4554329, "Review Title": "NOT GIVEN", "Review Content": "Website re-creation\n\n\nVery easy to navigate and find the solutions to my needs\n\n\nSlightly pricey on some items which pushes me towards compromise. Fortunately, the compromise is also available.\n\n\nTake your time and do complete research\n\n\nHardware issues and a need for updated software solutions. Both problems were easily resolved without searching elsewhere.", "Publish Date": "2021-01-14", "Author": "David B. M."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 4457511, "Review Title": "NOT GIVEN", "Review Content": "Call manager upgrade\n\n\nThe reachability of the engineers assigned to a particular issue.\n\n\nThe amount of time it takes to resolve and issue.\n\n\nCDW is overall a good company to do business with. They are very concerned about their clients well being.\n\n\nOur voice software was outdated. After upgrading our software the benefits we have reached have been performance and security,", "Publish Date": "2020-11-09", "Author": "Jason R."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 4208006, "Review Title": "NOT GIVEN", "Review Content": "I utilize CDW for my small office printer purchases. We prefer Xerox because we've had much better luck with warranty claims through them vs Dell--and CDW is closely partnered with Xerox and fulfills e-concierge orders.\n\n\nShipping is fast and my sales rep is both knowledgable and courteous. The prices are reasonable, inventory (on current items) is usually good. CDW provides good support for hardware purchased through them and if they don't have the product I need, they often have something similar enough that I can make it work.\n\n\nThe website often lists multiple items with the same model number but slightly different skus, which is confusing. My other primary complaint is that they frequently discontinue models--which then causes toner costs to skyrocket. That might be beyond CDW's control, though.\n\n\nMake sure you get a good sales rep to work with. Companies are only as reliable as your point of contact. Advocate for your company and your needs until they are met--by your rep, or another one. Their staff covers a wide variety of specialties. For example, they have different reps that specialize in large copiers versus small business printers, and it varies from brand to brand as well. If you find a product you like, it's better to buy a few so that you'll have them--as it's likely they will run out or be discontinued at some point, which can make rollouts challenging.\n\n\nWhen I order hardware I know it will be the correct thing, arrive ahead of my expectations, and they will provide support if necessary. We used to purchase small office printers through a local vendor and we were frustrated by their lack of support, as well as their selling us older model discontinued printers that they had leftover stock of without telling us. With CDW I'm always getting the latest products available.", "Publish Date": "2020-05-07", "Author": "Joe N."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 3455768, "Review Title": "NOT GIVEN", "Review Content": "CDW helped with our Chromebook project. They proved a very helpful and patient sales representative who was able to answer all of my questions. All in all, they helped us save thousands of dollars while still providing good quality products. We were upgrading some of the hardware in our building and did not have a very large budget so CDW came in habdy!\n\n\nThe represeantavtes who work for CDW provide a very good expirence. They are very patient and knowledgeable about products and services. My project with them was compleated in less than a month duw to how fast the representative was in getting me the best deal and shipping the products out.\n\n\nI honestly do not have any complaints! They were very helpful and gave me no reason to complain.\n\n\nI would definitely recommend CDW for all of your technology needs! They do not charge for a consult and provide very knowledgeable sales reps who make the entire process very simple. If you want to check them out before speaking to someone, you can go on their website and browse their selection of items and prices.\n\n\nSince discovering CDWG, we now able to complete projects with ease. We no longer have to worry about going over budget or not completing a project within a certain timeframe. Another perk of CDW is how great their prices are! CDW has saved us thousands of dollars from our old method of purchasing things.", "Publish Date": "2019-10-20", "Author": "Karim K."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 2163432, "Review Title": "NOT GIVEN", "Review Content": "What i like about CDW is their online ordering process. It is very streamlined and easy to use. Ive order Adobe licenses, cisco hardware, microsoft books, and lots of computer peripherals. Our account rep is quick to help with any ordering questions.\n\n\nWe ordered some expensive core switches in the past and my account rep will always put a CDW engineer on the call to help with our questions.\n\n\nI did have an account rep years ago that was taking way to long to help me with my requests. This has been rectified now.\n\n\nUse the online ordering. Smooth\n\n\nWe use CDW to keep up to date with the latest Cisco access points, AP controllers and catalyst switches.", "Publish Date": "2019-04-26", "Author": "Tim L."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 2035988, "Review Title": "NOT GIVEN", "Review Content": "My school worked with a CDW representative when we were in the process of purchasing Adobe software.  The rep gave us detailed information on the software and how it could be used, the cost as well as giving us installation help.\n\n\nGreat customer service and support.  Reasonable prices and quick turn around.\n\n\nThere wasn't anything that I disliked about CDW.\n\n\nWe received great support when trying to select a software to use for the school.", "Publish Date": "2019-04-02", "Author": "NOT GIVEN"}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 1187275, "Review Title": "NOT GIVEN", "Review Content": "As a school administrator, I do not have a lot of time to research which products would best meet my needs. After a brief conversation with a CDW sales representative, I had my questions answered!\n\n\nThe customer service was exceptional. The representative knew the information and was very helpful!\n\n\nThere was not much that I disliked. The phone prompts were easy to follow and I was answered quickly.\n\n\nTheir customer service was great!", "Publish Date": "2018-11-16", "Author": "NOT GIVEN"}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 591796, "Review Title": "NOT GIVEN", "Review Content": "CDW is our hardware provider, awesome service, quick response\n\n\nThey are very quick in responding, gives resonable price for the hardware we need and timely delivery\n\n\nEverything about CDW is great, I like everything about it.", "Publish Date": "2018-01-26", "Author": "NOT GIVEN"}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 475292, "Review Title": "NOT GIVEN", "Review Content": "Provide us with most of our hardware and software we purchase\n\n\nVery competitive prices, great selection, quick shipping.\n\n\nDespite the great selection, there are often items we have to go elsewhere to find.\n\n\nCompare prices to others", "Publish Date": "2017-11-24", "Author": "NOT GIVEN"}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 169529, "Review Title": "NOT GIVEN", "Review Content": "system operation is easy to use, products and services for business is easily available for use.\n\n\nserver is up an down and sometimes takes long time to get back on the production.\n\n\nWe primary use CDW as data warehouse distribution and not for problem solving.", "Publish Date": "2016-09-08", "Author": "Kevin L."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 145924, "Review Title": "NOT GIVEN", "Review Content": "Obtaining quotes is quick, prices will very often beat other vendors.\n\n\nNot too easy to get quotes without direct interaction.  Minor issue though\n\n\nGo for it - especially for larger purchases, no reason not to get another quote!\n\n\nDecreased prices for purchases, often less work purchasing as well.  Saved time and money.", "Publish Date": "2016-06-18", "Author": "Chris P."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 128514, "Review Title": "NOT GIVEN", "Review Content": "They have a lot of products available and it is easy to search for them on their website.\n\n\nWe were not receiving the best prices and it was not easy to get a hold of our rep at times. I have had better customer service experience with other vendors.\n\n\nPlease due your due diligence and verify the prices for their products compared to other vendors.\n\n\nWe used CDW for procurement of hardware and software licenses when I first came on board. We know request for quotes from at least three vendors before we purchase hardware or software.", "Publish Date": "2016-05-10", "Author": "Tom P."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 72284, "Review Title": "NOT GIVEN", "Review Content": "Whenever I have had to contact CDW, they have been helpful. They answer quickly, and have yet to provide me with an unhelpful answer.\n\n\nI really can't say anything bad about CDW. They have been excellent to work with and I would gladly recommend them to anyone who asked about a solution they offer.\n\n\nI have used CDW to purchase numerous solutions in the past. I am currently building out a data center with things I have purchased from CDW.", "Publish Date": "2015-11-23", "Author": "Zachary R."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 21993, "Review Title": "NOT GIVEN", "Review Content": "I really like knowing that just about anything I could need can be purchased through them.  Whether hardware software, or services they have a solution for just about any need.  In addition even smaller customers are assigned a solution advisor (salesman!) who helps walk you through some of the process required in ordering through them as their catalog is huge and covers many different versions of the same product.\n\n\nAs mentioned above each customer has an advisor that helps them with their requests and needs.  That advisor, one would think, would have at least a modicum of experience in many of the technologies CDW offers but I have found that more often than not I am the more experienced and I end up using the advisor more as an order taker vs, advisor.\n\n\nIf you are not 100% committed to always getting the lowest price and want a one stop shop for all your IT needs, this is the place.", "Publish Date": "2014-04-22", "Author": "Jeff R."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 12719, "Review Title": "NOT GIVEN", "Review Content": "They have a great search tool for anything and everything.\n\n\nThey can never beat Provantage.com on items that they both carry.  My account rep told me that \"the price you just told me is below our cost\" and that \"Provantage.com will be out of business soon since their prices are so low.\"  That was over 2 years ago and they are still going strong...  until CDW can beat their prices or until Provantage.com goes out of business, I'll be getting my gear from the cheaper of the two.\n\n\nLook elsewhere for the lower price.", "Publish Date": "2013-04-29", "Author": "Eric M."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 10994, "Review Title": "NOT GIVEN", "Review Content": "They are a complete, 1-stop shop for technology -- not just hardware, but also a diverse range of IT solutions and services, including but not limited to professional services, leasing, telcom, managed services, networking, mobility, security, etc., etc.  They also have industry-specific solutions catalogs (i.e., in healthcare they have a healthcare catalog\n\n\nMay not be the best price (you may be better price-shopping on amazon), but the service makes up for it\n\n\nCDW ranks #31 on the largest private companies in the US.  They have grown dramatically by being one of the top, specialized technology vendors -- it's a great one-stop shop for businesses, esp small medium growing businesses", "Publish Date": "2013-02-21", "Author": "Eugene C."}, {"Product Name": "CDW Hardware", "G2 Link": "https://www.g2.com/products/cdw-hardware/reviews", "Review ID": 11565, "Review Title": "NOT GIVEN", "Review Content": "CDW has always had everything we needed, either for our own use or to fulfill a contract. There were a few exceptions but in those instances they still managed to meet our deadline and deliver all products.\n\n\nVolume pricing was hard to secure and overall prices may be higher (I would counter that statement by saying we never received any broken or opened products from there. Several other distributors had those problems)\n\n\nIf price isn't your absolute concern and you want reliable delivery and stock levels, CDW is the perfect option.", "Publish Date": "2013-03-10", "Author": "Jakub A."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 222082, "Review Title": "Sherpas in the Cloud", "Review Content": "Describe the project or task Accenture helped with:\nSherpas came in and learned a new UX platform called Skuid and implemented it for a fin serv customer. Throughout the courtship with a new partner you always wonder if they like you as much as you like them. The feeling was mutual in this case as we each brought very different skill sets to the table to best serve the shared customer.\n\nWhat do you like best about Accenture?\nIt's always great to meet good people who work for cool companies, and it's even better when customers trust them. These guys are trustworthy and professional. Also their willingness to take on a new UX platform as a challenge and learn it and own it stood out to us from other partners we have worked alongside.\n\nWhat do you dislike about Accenture?\nNothing really to dislike about these guys. Maybe ... if I have to answer, they are resistant to having all employees buy Skuid licenses, as well as have all engineering resources take our formalized training program and get certified.", "Publish Date": "2017-01-13", "Author": "Andy G."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 68630, "Review Title": "Quick to do work but shallow about needs.", "Review Content": "What do you like best about Accenture?\nThey were very friendly and made sure their contact information was available for us to talk to them as needed. They had a fast turnaround time for the work given to them.They have many skills under their roof. They assigned people on our time zone to work with us.\n\nWhat do you dislike about Accenture?\nWhile they had given us lines of communications they didn't respond to us in a timely manner. When an update was to be delivered there was a non response from the project manager and developer. Emails and phone calls were not returned at all. We had to contact a VP to get back to us and it took a day to get back to us. They were fast to move on working but they missed details of the work needed to be done. For example we needed an excel script made but the developer worked on OSX and the macro did not function as well on Windows. No one else was assigned that could do it natively on Windows, it did not work very smoothly on a Windows computer, an in house person had to fix it.\n\nRecommendations to others considering Accenture:\nThey should look to other vendors as they do not seem to offer very good communication or support. They should demand the people working on their project use the same environment as their own to ensure the work is compatible with the systems. Get contact information from executives and managers of the people you are working with if they become non communicative.\n\nDo your own homework, they offered up solutions that were more expensive to the cost of the project when a little leg work would have solved it without additional cost.", "Publish Date": "2015-10-29", "Author": "NOT GIVEN"}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 211729, "Review Title": "Yes to Cloud Sherpas!", "Review Content": "Describe the project or task Accenture helped with:\nCloud Sherpas helped us with a contracting and accounting project that we were handling with outside companies.\n\nWhat do you like best about Accenture?\nThe consultants at Cloud Sherpas as wonderful! They are excellent in customer service and always ready to address and needs. They make your projects their goals and make you feel like a priority!\n\nWhat do you dislike about Accenture?\nThere is not anything that I dislike about the consulting company, they get their jobs done.\n\nRecommendations to others considering Accenture:\nWhen considering get them a chance before making any final decisions.", "Publish Date": "2016-12-21", "Author": "Ashley C."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8684254, "Review Title": "Good organization to start your career", "Review Content": "What do you like best about Accenture?\nBest thing about Accenture is that they care about thier employees and provide different trainings for free and support you as long as you are with them.Also you will be able to participate in different CSR activities which is something I enjoyed a lot. Cultural activities within the organization is a great initiative.\n\nWhat do you dislike about Accenture?\nThey can improve upon the trainings quality by incorporating qualified trainers also they should try to raise the initial CTC offered to freshers here in India.\n\nRecommendations to others considering Accenture:\nAccenture is a good company for freshers bit i would say experienced candidate should definitely look upon other options while considering to join them as job security has gone down in these years.\n\nWhat problems is Accenture solving and how is that benefiting you?\nI have started my career with Accenture and it was a great experience working with them. Once you are hired as freshers they will enroll you in 2 months trainings as per you module.I will say training was average and it's something they can improve upon.", "Publish Date": "2023-10-02", "Author": "Saurabh C."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8589408, "Review Title": "Great experience with highly experienced consultants", "Review Content": "What do you like best about Accenture?\nThey are experts in all matters relating to HR Consulting. Be it the functional aspect like curent state analysis or implementing some software for you. I'm  amazed by the amazing team of consultants. Though we used only the hr consulting, im sure they can provide you a similar experience  on other areas as well.\n\nWhat do you dislike about Accenture?\nSome junior folks in the team are untrained and have no knowledge about tye product but add upto the cost whil implementing a software or providing any other service.\n\nWhat problems is Accenture solving and how is that benefiting you?\nAccenture helped us in implementing service now for raising tickets relating to all queries or notifying the team on an issue. This was a completely new tool for us and they implemented it without much hassel.", "Publish Date": "2023-09-11", "Author": "Karishma S."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8681670, "Review Title": "Reliable and Integration for Business", "Review Content": "What do you like best about Accenture?\nIts provide happy environment to employee, comney moto is like grow together, take care every employee , paying good salary and service to employee in all domains.\n\nWhat do you dislike about Accenture?\nNothing as dislike , its a good compney who takes care cilents as well as employees\n\nRecommendations to others considering Accenture:\nBeat place to work, best service base compney.\n\nWhat problems is Accenture solving and how is that benefiting you?\nIt is a global professional service compnay its provide sevices to business  to compnies as well as govrnment to built there digital core. aceleraste revenue growth optimize there operations,enhance citizene servcie.Its also provide could and data secqurity.", "Publish Date": "2023-09-30", "Author": "Ranjeet M."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8301803, "Review Title": "Knowledgeable staff and quite good contractors", "Review Content": "What do you like best about Accenture?\nThe staff at Accenture is quite knowledgeable and has quite an expertise in technology. They have been working with us for quite some time, and the managers there are also well aware of the expectations\n\nWhat do you dislike about Accenture?\nSometimes, the staff becomes a little too lenient and unprofessional in terms of proactiveness, so somebody has to keep a status check to not let them falter back.\n\nRecommendations to others considering Accenture:\nQuite a good service provider, with good employees, you can definitely choose Accenture for your business needs.\n\nWhat problems is Accenture solving and how is that benefiting you?\nAccenture is our partner, providing us with employees on a contract basis for various projects in the organization. They have been part of some very critical and client-centric projects, and their expertise is helping my company achieve goals in time.", "Publish Date": "2023-07-10", "Author": "Sonal G."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8611999, "Review Title": "Accenture - SAP", "Review Content": "What do you like best about Accenture?\nAccenture is good in terms with SAP because they know where to fix certain issues and easily provide faster feedbacks when we encounter problem that is really complex.\n\nWhat do you dislike about Accenture?\nSometimes there are a lot of downtime which slows down the processes in solving complex deals and hopefully they are going to fix that in the future to lessen the downtime.\n\nRecommendations to others considering Accenture:\nN/A\n\nWhat problems is Accenture solving and how is that benefiting you?\nIt helps the integration of the third party applications and mostly for data management. It made easier for solve business problems and handle the issues easily.", "Publish Date": "2023-09-14", "Author": "John Mark G."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8356514, "Review Title": "accenture review", "Review Content": "What do you like best about Accenture?\nVery professional and experiences global resources that are able to provide information and advise on how to implement SAP successfully for a global company and enterprise\n\nWhat do you dislike about Accenture?\nChallenging to work is large global off shore team that is available during US central hours so it requires a lot of time and effort to find the best approach for communciation and deliverables\n\nRecommendations to others considering Accenture:\nProvide better communication and technical tools for documentations and sharing information.  Leverage microsoft teams to store information and share information.\n\nWhat problems is Accenture solving and how is that benefiting you?\nI used accenture for large scale sap global implementations.  They have a lot of experience with global new SAP implementations and provided many implementation services from planning to implementation.", "Publish Date": "2023-07-25", "Author": "Monte J."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8609392, "Review Title": "Accenture Review", "Review Content": "What do you like best about Accenture?\nThe indsutry knowledge the consultants take to ensure they are familiar with every solution a customer needs to get the desired outcome.\n\nWhat do you dislike about Accenture?\nNothing too bad, the reps I have worked with are really precise, but do have a delay when asking questions.\n\nRecommendations to others considering Accenture:\nIf anyone is looking to involve consultants that take time out to understand various products, it can help any organization achieve more.\n\nWhat problems is Accenture solving and how is that benefiting you?\nConsulting work from accenture to make ease of doing business relatively easy as they have industry professionals.", "Publish Date": "2023-09-13", "Author": "Naveed M."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8404451, "Review Title": "Accenture", "Review Content": "What do you like best about Accenture?\nI like Accenture very much as they do work innovatively and workplace is also good.\nThere are many learning and development opportunities.\nThey provide good services.\n\nWhat do you dislike about Accenture?\nThere is nothing to dislike.\nThey provide different insurance services like health insurance, vision , dental insurance and life insurance. There work is unique.\nSo this is beneficial for us.\n\nRecommendations to others considering Accenture:\nI would like to recommend Accenture to others also.\n\nWhat problems is Accenture solving and how is that benefiting you?\nAccenture solve complex problems. They provide different insurance services like health insurance, vision , dental insurance and life insurance. There work is unique.", "Publish Date": "2023-08-04", "Author": "Neha Y."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8359721, "Review Title": "Perfect consultant for your biz dev needs", "Review Content": "What do you like best about Accenture?\nIt has a full spectrum of infrastructure managed services. It help stabilize, optimize and manage your business development needs. It reduced IT help desk resolution and handling time.\n\nWhat do you dislike about Accenture?\nThe customer service is not par. You get delayed responses and that creates window for deflux of workflow. Sometimes we need constant support and provision to our area of interest.\n\nWhat problems is Accenture solving and how is that benefiting you?\nHelping in lead generation, from their authentic pool of original data source. The service provided by Accenture is at global level so the data sets you work with is huge.", "Publish Date": "2023-07-26", "Author": "Niraj S."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8544078, "Review Title": "Recommended for fresh graduates", "Review Content": "What do you like best about Accenture?\nI really love the benefits and robust training they provide for their employees.\n\nWhat do you dislike about Accenture?\nThe low compensation for fresh grads. I suggest they offer their employees a competitive package, especially for new grads.\n\nRecommendations to others considering Accenture:\nYou might consider Accenture because it provides competitive benefits for its employees and is good for fresh grads. Initial step or pathway for career growth.\n\nWhat problems is Accenture solving and how is that benefiting you?\nI think they are constantly improving regarding the benefits they provide.", "Publish Date": "2023-08-30", "Author": "Jellie Mae  O."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 7466706, "Review Title": "Accenture - a great place to work", "Review Content": "", "Publish Date": "2022-12-18", "Author": "Akash J."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8370757, "Review Title": "Excellent Service Provider", "Review Content": "What do you like best about Accenture?\nThe convenience and professionalism of all service provider i have worked with. They are beyond excellent and with high standards that every company has to have.\n\nWhat do you dislike about Accenture?\nMaybe the cost but so far you get what you paid for so its worth it.\n\nRecommendations to others considering Accenture:\nMaybe vost efficieny wise\n\nWhat problems is Accenture solving and how is that benefiting you?\nIt enables to manage everything i needed with just one company cause they have all departments that can provide you services like consultancy, techincal, marketing.", "Publish Date": "2023-07-28", "Author": "Jeremiah W."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 7675127, "Review Title": "Company - Accenture", "Review Content": "What do you like best about Accenture?\nIt provides an accurate diagnosis and guides us in the right way for personal growth.\n\nThe best aspect of the company's growth and expansion was the expert consulting on the necessary information.\n\nAnd it was excellent to be able to increase productivity through a variety of instances we hadn't considered and effective consulting.\n\nWhat do you dislike about Accenture?\nDeciphering the statement of work might be difficult and take some time when contracting. Additionally, they take longer than their rivals to resolve disputes about delivery terms.\n\nRecommendations to others considering Accenture:\nNever work for money; always be yourself and do what you love. By making wise decisions for your life, make work your lifestyle and the main source of your enjoyment.\n\nWhat problems is Accenture solving and how is that benefiting you?\nData analytics hiring, remote work opportunities, and customer service positions. What matters to me is remote work and an emphasis on creative solutions. Accenture's core business is providing professional services and consulting to organisations that want to operate at their very best while achieving effective, measurable results. At the time our team deployed it, the data platform served all of those purposes and more.", "Publish Date": "2023-02-04", "Author": "AVINASH K."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 7666568, "Review Title": "Experiencing Accenture's Exceptional Service Delivery", "Review Content": "What do you like best about Accenture?\nAccenture is known for its:\n\nExpertise: Accenture has a deep pool of experts across various industries and domains, providing clients with the necessary knowledge and skills to solve complex business problems.\n\nCustomization: Accenture offers customized solutions that are tailored to meet the specific needs and requirements of each client, helping them achieve their desired outcomes.\n\nTechnology capabilities: Accenture has a strong technology focus, utilizing innovative technologies to drive digital transformation and solve business problems.\n\nGlobal presence: With a global network of offices and delivery centers, Accenture provides clients with a seamless, integrated experience, regardless of location.\n\nStrong track record: Accenture has a proven track record of delivering successful outcomes for clients, making them a trusted partner for businesses looking to drive growth and improve performance.\n\nWhat do you dislike about Accenture?\nsome potential downsides that clients and customers may face while using Accenture's services:\n\nCost: Accenture's services can be expensive compared to other service providers, which may not be feasible for some small businesses and organizations.\n\nBureaucracy: Accenture is a large organization with a complex structure, which can sometimes result in bureaucratic processes and slow decision-making.\n\nLack of personal touch: With a large team of consultants, some clients may feel like they are not receiving a personalized experience, which can be important for building a strong and trusting relationship.\n\nDependence on Accenture: Accenture's solutions and services are designed to be highly integrated and dependent on their expertise and technology capabilities, which can make it difficult for clients to transition away from Accenture if needed.\n\nWhat problems is Accenture solving and how is that benefiting you?\nAccenture is a global professional services company that provides consulting, technology, and outsourcing services to various industries and clients. They help their clients solve business problems by providing customized solutions that address their specific challenges and needs, leveraging their expertise and technology capabilities. Accenture's services aim to improve efficiency, effectiveness, and competitiveness for their clients, helping them achieve their goals and drive growth.", "Publish Date": "2023-02-02", "Author": "Rishav R."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8356821, "Review Title": "Outstanding Business", "Review Content": "What do you like best about Accenture?\nThe effectiveness and the reliability it supports to its clients.\n\nWhat do you dislike about Accenture?\nI think its just cost and the standards is so high that employing people is such a problem.\n\nWhat problems is Accenture solving and how is that benefiting you?\nProvides the most effective strategy needed for the client and excellent relevant services provided and assigned by the group of consultant. It provides all services needed.", "Publish Date": "2023-07-27", "Author": "Hazel P."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8604347, "Review Title": "Great place", "Review Content": "What do you like best about Accenture?\nDiversity and inclusion is at its best at Accenture\n\nWhat do you dislike about Accenture?\nCertainly level of micro management which is not good\n\nRecommendations to others considering Accenture:\nNa\n\nWhat problems is Accenture solving and how is that benefiting you?\nIn all possible ways, great support and problem solving", "Publish Date": "2023-09-13", "Author": "Ragul R."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8174817, "Review Title": "Unleashing Digital Potential and Driving Business Success means- Accenture", "Review Content": "What do you like best about Accenture?\nGlobal presence, expertise, collaborative approach and technology capabilities provide the best services, which are essential not only for ours but also for other companies as well.\n\nWhat do you dislike about Accenture?\nCost, Communication and coordination. The pricing structure may not be accessible to all businesses, particularly those seeking more cost-effective solutions, due to global presence sometimes its difficult to coordinate with different clients.\n\nRecommendations to others considering Accenture:\nI will say go for efficiency and END result rather than think about the cost.\n\nWhat problems is Accenture solving and how is that benefiting you?\nDigital Transformation- It assists us in developing and implementing digital strategies, optimizing operations, and integrating new technologies; it also helps to identify opportunities for disruptive innovation and guides us to transform our business models.", "Publish Date": "2023-06-10", "Author": "NOT GIVEN"}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8286431, "Review Title": "Excellent group of vendor profesional", "Review Content": "What do you like best about Accenture?\nTheir talent sourcing, they match the skills we were looking for in a sales Person and fulfilled our headcount demands with great and committed talent. Also a diverse group\n\nWhat do you dislike about Accenture?\nPerhaps the rotation of personnel, given the \"vendor\" titled some resources adopt their engagement to Accenture could easily change sometimes we had to start from scratch with someone new too often\n\nWhat problems is Accenture solving and how is that benefiting you?\nSales targets overachieved with resources and program management from Accenture staff, they also have a great motivativated team and aligned to our strategy quicky", "Publish Date": "2023-07-05", "Author": "NOT GIVEN"}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 8198315, "Review Title": "Ex employee of Accenture", "Review Content": "What do you like best about Accenture?\nWork culture and employee satisfactory policies\n\nWhat do you dislike about Accenture?\nThere was nothing to dislike . however , there is always scope of improvement\n\nRecommendations to others considering Accenture:\nYes I recommend this company to my friends/colleagues as they have wide variety of projects with latest technologies\n\nWhat problems is Accenture solving and how is that benefiting you?\nI started my career with Accenture and worked there for 4.5 years.\nThe experience was great", "Publish Date": "2023-06-09", "Author": "Heena A."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 7452382, "Review Title": "Had a great experience working with Accenture team!", "Review Content": "What do you like best about Accenture?\nWe got the resources at a very affordable price as per the project cost and we are very satisfied with the outcome. The dedication of the team is really commendable.\n\nWhat do you dislike about Accenture?\nNothing as of now as I have worked on multiple projects with Accenture now and it seems we are one team now. They are the best!\n\nRecommendations to others considering Accenture:\nAccenture is one of the best IT companies that one can work with. If you are looking for dedicated resources then they have the best resources.\n\nWhat problems is Accenture solving and how is that benefiting you?\nWe were looking for the dedicated resource for MS Dynamics and looking for the same in market but weren't able to get the experienced resources in budget. Finally, we had a chance to discuss with Accenture team and had a great experience working with their team.", "Publish Date": "2022-12-02", "Author": "Chirag V."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 7703398, "Review Title": "A great consulting firm: Accenture", "Review Content": "What do you like best about Accenture?\nAccenture is a massive organization with reliable information that permits them to give master counseling administrations in information examination and programming, settling on them an extraordinary decision.\n\nWhat do you dislike about Accenture?\nWe want extra administration and activity, yet there is joint effort or grinding with working-level staff.\n\nEverybody requirements to move together towards a shared objective.\n\nRecommendations to others considering Accenture:\nAccenture is an incredible group to accomplish, depending on your association's size and financial plan.\n\nWhat problems is Accenture solving and how is that benefiting you?\nThey facilitate execution/innovation conveyance projects by acquiring gifted SMEs rapidly and effectively. They additionally can scale and support arrangements long haul.", "Publish Date": "2023-02-11", "Author": "Harshit A."}, {"Product Name": "Accenture", "G2 Link": "https://www.g2.com/products/accenture/reviews", "Review ID": 7438309, "Review Title": "Wish me luck!", "Review Content": "What do you like best about Accenture?\nInternships and mentorship programs for entry- level employment opportunities that really sell me on the company. The pay is above average if I can land the position.\n\nWhat do you dislike about Accenture?\nHere's hoping that I will get considered for a callback from upper management, recruiter, 9r scheduler. I haven't worked much 2ith this brands partners. Community engagement will be my strategy to focus on.\n\nRecommendations to others considering Accenture:\nBe yourself and follow what you love, so as to never work to make money. Make work your lifestyle and make it the dominant aspect of your happiness by implementing good choices for your life.\n\nWhat problems is Accenture solving and how is that benefiting you?\nEmployee hiring and remote jobs in data analytics as well as customer service roles. Remote work and a focus on innovative solutions is what is important to me.", "Publish Date": "2022-11-29", "Author": "Laura R."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 8929307, "Review Title": "NOT GIVEN", "Review Content": "They were able to align the different teams and departments to help us better understand what matters for each group\n\n\nThey don't go as deep or get into the weeds of day to day work that many organizations require\n\n\nEnsure that they know your business really well and provide specific guidance vs general recommendations\n\n\nWe were deciding which billing platform to use for our subscription business after acquiring a smaller company that we had to integrate", "Publish Date": "2023-11-27", "Author": "Poya O."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 8858297, "Review Title": "NOT GIVEN", "Review Content": "It gave us an opinion for which software suites our requirements\n\n\nHigh prices but it was relatively justified\n\n\nIf you want a professional and correct opinion you have to use this consultancy firm.\n\n\nImplemeting consolidation software", "Publish Date": "2023-11-27", "Author": "Richard A."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 8546454, "Review Title": "NOT GIVEN", "Review Content": "They have experts that meet my needs and when I have an issue, somebody is always easily accessible. I believe they have smart people that care working for them.\n\n\nI heard there could be compliance issues in terms of the way information is shared, and the way people with work with clients in the same industry.  Security is very important.\n\n\nMake sure you do your research and pick the consulting company that best suit your needs and have experience in the business.\n\n\nFinancial advice and taxes. A way to manage risk and make the best financial decisions to ensure I get return on investment are important factors that help me build wealth.", "Publish Date": "2023-08-30", "Author": "NOT GIVEN"}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 8598074, "Review Title": "NOT GIVEN", "Review Content": "Diving into details, keeping timelines, and vast knowledge.\n\n\nHighly cost. Sometimes the process got too slow.\n\n\nStart the process as early as possible, we gave it three months and it was on the verge of the renewal date of our SOC2 certification for the next year.\n\n\nSOC2 Type2 accreditation. Deloitte assisted us in getting this across the line with their experienced analyst.", "Publish Date": "2023-09-12", "Author": "Erez E."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 7641227, "Review Title": "NOT GIVEN", "Review Content": "I like that they are a large company that you can trust to accomplish what they need to do. We are confident that the results of an audit reflect how we are doing. There is a website they have set up that tracks everything well.\n\n\nThere is some outsourcing to other countries that sometimes can create confusion - questions that are confusing and different time zones to work with. The auditors could check in on us more often to work harder to build a relationship with us.\n\n\nBuild a relationship with the auditors and make sure to communicate regularly with them. Make sure you are providing them everything that they need.\n\n\nOur company needs to have an auditor to make sure our 10K's and 10Q's are properly filed. They are an established, large company that has found items that help us improve our work.", "Publish Date": "2023-01-30", "Author": "Shauna T."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 8318219, "Review Title": "NOT GIVEN", "Review Content": "Their services are really good specially legal service.\n\n\nAs i am not sure what is their down side. My experience with them is great.\n\n\nI would like to say please if you need the best go with them.\n\n\nIt helps me solving to scaling my business", "Publish Date": "2023-07-13", "Author": "Subhankar S."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 8579997, "Review Title": "NOT GIVEN", "Review Content": "They provide timely and accurate services\n\n\nTheir rates are higher than competitors in the market\n\n\nGo for it\n\n\nIt solves vast array of Consulting practices ranging from audit to assurance", "Publish Date": "2023-09-12", "Author": "NOT GIVEN"}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 7643118, "Review Title": "NOT GIVEN", "Review Content": "They are really helpful in helping us to implement salesforce analytics where they have fly in a data scientist from France to assist us to implement predictive modelling in Salesforce\n\n\nPre-covid : It would be good if they can be available onsite for the post production implementation warranty period for the full 30 days.\nNote that they are available off site basis as they need to move on to another project\n\n\nWould highly recommend them\n\n\nBuilding predictive analytics on how likelihood our prospects buying our products , also the churn likelihood and upselling opportunity.\nAlso build CRM workflow process", "Publish Date": "2023-01-26", "Author": "James A."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 8355176, "Review Title": "NOT GIVEN", "Review Content": "Expertise knowledge on industry,Global presence,Comprehensive Solutions, Digitlisation,Thought Leadership,Collaborative Approach\n\n\nShared services work model, effectiveness of work for few teams, work given to college graduates.\n\n\nWork culture\nEmployee Benefits\nTechnology enhancement\n\n\nBusiness Strategy, Digital Transformation, Risk Management, Financial Advisory, Technology Implementation, Audit Services, Taxation, Client Services, Customer Management", "Publish Date": "2023-07-25", "Author": "NOT GIVEN"}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 7644638, "Review Title": "NOT GIVEN", "Review Content": "I love their timely responses, depth of knowledge, and patience when it comes to larger questions\n\n\nCommunication could be more frequent when collaborating on projects.\n\n\nI strongly advise anyone seeking a consulting firm to consider Deloitte\n\n\nDeloitte is providing our company with incredible IT solutions that are allowing us to overcome daily issues and grow on the tech side of our business", "Publish Date": "2023-01-27", "Author": "John M."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 7230202, "Review Title": "NOT GIVEN", "Review Content": "Quality consulting at your fingertips.\nHeavily invest in training their consultants in their respective domains.\nThe annual bonus and reviews are good.\nWork environment  varies from team to team.\n\n\nThe cost billed to the client is exorbitant, and the consultant's cut in the process is rather fractional. This may vary from location to location. I am talking specifically of consultants in India.\nThe work environment can sometimes be a little toxic, and this could be subject to the COE you're aligned to.\n\n\nTechnology consulting for multiple domains like servicenow, digital products and salesforce. As a consultant associated with the firm, the company spends a lot on training.", "Publish Date": "2022-10-19", "Author": "Arun F."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 7156426, "Review Title": "NOT GIVEN", "Review Content": "Deloitte has a talent pool with a depth of knowledge and an excellent center of excellence. The project management and presentation skills of consultants are quite good.\n\n\nThey sometimes lack technical expertise directly within the organization and often sublet 3rd party companies or external consultants for technical expertise. Also they are one of the most expensive vendors available.\n\n\nThe quality of work is always good with Deloitte Consulting. One recommendation is always to have post-acceptance criteria, and post-go-live support negotiated clearly and well in advance.\n\n\nDeloitte Consulting is among the biggest consultancy firms in technology implementation and support projects. I was involved with Deloitte for the implementation of CRM within our firm.", "Publish Date": "2022-09-30", "Author": "Vikram Singh C."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 7168731, "Review Title": "NOT GIVEN", "Review Content": "The ease of use, price was high but they made sure to cover everything we needed\n\n\nCost was high, but its a competitive market and you pay for the knowledge.\n\n\nDefinitely do your due diligence but you will find they are worthy of their reputation\n\n\nHelped us implement some software for a client of mine. Made the process very simple, and handled everything from soup to nuts.", "Publish Date": "2023-01-06", "Author": "NOT GIVEN"}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 5338425, "Review Title": "NOT GIVEN", "Review Content": "In the year 2014 through 2016, We worked on a project to implement the Cloud SPM solution in our organization, we partnered with Deloitte for the same. The Deloitte  team had good understanding of the technology and the team was able to understand our requirements and helped us with the complete implementation of the product.\n\n\n1. Team's command on technology.\n2. Team was well organized and maintained a good communication channel.\n3. The team was highly professional at work. They were able to understand the requirements and come up with solutions.\n\n\nNothing as such, but I guess the timeline was not met completely. It would have been great if the timely delivery of the work was met. However this could be treated as an area of improvement and not a demerit.\n\n\nDeloitte has some of the best teams available to help its customers. I am sure you will find it great to partner with them.\n\n\nWe were able to implement the variant solution.  Deloitte also helped the in-house team in learning the product. The coding standard followed by Deloitte was in line with the industry standard.", "Publish Date": "2022-02-11", "Author": "Aurojeet P."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 7005518, "Review Title": "NOT GIVEN", "Review Content": "Timely technical reports that helps in continual improvement\n\n\nNot Applicable in my case. Not Applicable in my case. Not Applicable in my case.\n\n\nHighly technical services\n\n\nEffective Implementation of Nessus", "Publish Date": "2022-08-18", "Author": "Dave Q."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 7224394, "Review Title": "NOT GIVEN", "Review Content": "quality of consultants, quality of deliverables\n\n\nnothing that i can think of - very impressed with their delivery\n\n\nn/a\n\n\ndata migration, customer strategy", "Publish Date": "2022-10-18", "Author": "NOT GIVEN"}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 6498295, "Review Title": "NOT GIVEN", "Review Content": "EDiscovery consulting service, analytics and reporting consulting\n\n\nAwesome team with great skill, always give best out of best to give the gold output with great work culture with positive attitudes and always helping nature, best company for any financial process\n\n\nLess interaction with deloitte application, lots of work process to achieve single or strength deliverable with timeline, most of product less interactive but strong result originated\n\n\nOf course, this the best service provider as big firm, always result oriented and productive work culture bringbto business sucess\n\n\nMany problems related to data processing and analytics towards eDiscovery solutions, review platforms and team make reviewing document more easily available to the attorney's and manger teams", "Publish Date": "2022-04-12", "Author": "NOT GIVEN"}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 5110438, "Review Title": "NOT GIVEN", "Review Content": "I worked with Deloitte for their Accounting Operations Advisory. I am trying to get my business off the ground and money, and finances are not my strong suit.\n\nWhen I spoke with Deloitte, they showed me how an accountant could help me cut the fat down with monthly expenses to increase the available profit margins.\n\nDeloitte and their consultants truly helped me form my business plan and financials. I don't think I could have done that part of my work without their guidance.\n\n\nThe biggest takeaway that I loved was, \"You need to make sure that you receive more money than what is being spent\"!\n\n\nHonestly, I didn't dislike anything. They are experts in their field, and I knew that which is why I chose them, and they did not let me down.\n\n\nThey make the accounting process so streamlined and easy to take off my plate.\n\n\nThe reason I chose Deloitte is that not only their reputation but mainly for the services they provide and advising me on the services I should consider for my business. I am utilizing the majority of their services because I know I need their guidence. Audit and assurance, consulting, financial advisory, risk advisory, tax, and related services.", "Publish Date": "2021-11-09", "Author": "Elana C."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 5349685, "Review Title": "NOT GIVEN", "Review Content": "Deloitte helped me with a cyber security initiative where I was trying to get the organization certified on ISo standards. I needed an expert third party to consult on best practices.\n\n\nThe professional approach and high quality of solution were evident in the structuring.  The consulting team engaged a solid internal team of experts to assist and contribute.\n\n\nThe pricing and initial quote seem to be over the budget, and sometimes the value proposition seems hard to justify. Also, some key members are present only in the early phase, but later they are only peripheral.\n\n\nDeloitte is a knowledge bank that has helped on the cyber security and auditing front, and they have greatly enhanced the organization's security posture. We also embarked on an ISO27001 journey with their help.", "Publish Date": "2022-02-15", "Author": "NOT GIVEN"}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 4806816, "Review Title": "NOT GIVEN", "Review Content": "Worked with the company I worked for in building a private company to a public one. They worked with executives on strategy, marketing and a solid business plan to take their business to the next level\n\n\nThey are professional and know what their talking about, you get what you pay for and if you're serious about building your business, you have to invest in something good to do it\n\n\nIt does cost money to want to build your business to the next level and you won't see your investment right away. Deloitte could do more to reduce customizations to meet business needs.\n\n\nThey helped one of the companies I worked for go public and make a lot more money and grow their business by creating a professional plan. We also needed a mobile friendly and modern citizen facing portal.", "Publish Date": "2021-11-05", "Author": "Stacy L."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 5344671, "Review Title": "NOT GIVEN", "Review Content": "Deloitte assisted my organization with improving our strategic processes associated with supply chain issues and helped to offer advice on personal and overall staffing models.\n\n\nDeloitte was most helpful in offering specific advice that was well-tailored to my organizations' needs and integrated well with our current processes and systems. Communications were seamless.\n\n\nSome of the methods of scheduling meetings and overall having consistent check-ins could have been better organized and more flexible to meet my organizations' needs.\n\n\nThe services from Deloitte Consulting Product Services helped my organization improve the time associated with analysis processes that we had previously been engaged with, which has allowed more time to be spent on other critical workstreams.", "Publish Date": "2022-02-14", "Author": "NOT GIVEN"}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 5286554, "Review Title": "NOT GIVEN", "Review Content": "Deloitte is best great place and they are working on very different projects ,with full potential ,they help with finance related survices\n\n\nI like best the learning , alot of learning is here ,great exposure of things ,great career growth, great knowledge, and great place to go and grow . This is best\n\n\nI don't dislike anything , it's all and all about person preception that how they take things if someone want to grow then they need to start learm so there is nothing like liking and disliking\n\n\nYes , it's great place to go\n\n\nFinance related solutions to the customers and it's a good relief to them because customer are in good hands .there are alot if benifits that can't describe in words", "Publish Date": "2022-01-20", "Author": "NOT GIVEN"}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 5256454, "Review Title": "NOT GIVEN", "Review Content": "Deloitte reviewed and audited our whole financial structure and organization.\n\n\nHow comprehensive they were, and the understanding they showed of our business and the tools we used. They are quite tech-savy and could communicate with our tech departaments.\n\n\nNothing in particular. The price is relatively high, but you get what you pay for.\n\n\nWe needed to fully audit our financial structure, chart of accounts, etc. Our company employs a lot of custom software that we use to invoice, so it was critical to have a consulting company that could understand our structure.", "Publish Date": "2022-01-07", "Author": "Carlos D."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 5363313, "Review Title": "NOT GIVEN", "Review Content": "Organization of event related to finance and management\n\n\nTheir professional behavior of the whole team along with iniwue solution proposition\n\n\nNothing at all. They are literally the best\n\n\nEveryone go for it.\n\n\nInducement of problem solvibg nature in the young individuals and the way Deloitte handled the whole situation is commendable", "Publish Date": "2022-02-21", "Author": "Prakriti B."}, {"Product Name": "Deloitte Consulting", "G2 Link": "https://www.g2.com/products/deloitte-consulting/reviews", "Review ID": 5098254, "Review Title": "NOT GIVEN", "Review Content": "I was invlved in ERP implementation for a a large multinational service provider in the South East Asia region. It involved implementation of project portfolio management, procure to pay and financials.\n\n\nThe methods for Consulting including project management, solution review and budget analysis. The tools used included cloud ERP product and diverse clous PaaS technology stacks\n\n\nNot really dislike, but the execution strategy could have included project planning to a more detailed drill. For example, identifying the deliverables for every project resources could be used in the plan with planned execution timelines.\n\n\nIt most efficiently helped understanding the product shortcomings, particularly during the feasibility analysis and also helped in improving the client business process keeping account of the initial requirements. This eventually improved performance and efficiency ofbthe client business in the near future.", "Publish Date": "2021-11-04", "Author": "NOT GIVEN"}, {"Product Name": "Imaginit Technologies", "G2 Link": "https://www.g2.com/products/imaginit-technologies/reviews", "Review ID": 5268788, "Review Title": "NOT GIVEN", "Review Content": "We regularly use Imaginit Technologies to help us purchase software. They help recommend the correct type of software for our company and how many seats we need for our team. They are knowledgeable about implementing software and recommending training or support for our team. They provide excellent feedback and follow up with us throughout the year, giving us lots of notice when it is time to renew our software licensing and take the time to explain any difference with the new contracts. Their website has a lot of resouces and tutorials that are useful and relavent to our company\n\n\nThey are consistent and keep in touch with us throughout the year, not just when it is time to renew. Provide many resources on their website and offer good training in the software they provide.\n\n\nI have a hard time keeping track of who our current representative is as it seems to change a lot almost mulitiple times a year. In the past, we had a direct connection with a sales representative that visited us and kept in touch with us throughout the year. She had an excellent understanding of our business and wanted to offer us the best solutions. It is a shame we don't have that kind of relationship with our new representative.\n\n\nThey provide a lot of knowledge and resources about the software that would be best suited to your industry and team. They offer resources and training on their website with many webcasts, tutorials and blog posts.\n\n\nThey have helped us choose the right software and figure out how many licenses are appropriate for the size of the team we have. They offered us help and problem-solving for implementing the server aspect of our software and for when we haven't upgraded our software to the latest version in a few years and needed to do a multistep process of different version installations to get our software up and running the latest version.", "Publish Date": "2022-01-12", "Author": "NOT GIVEN"}, {"Product Name": "Imaginit Technologies", "G2 Link": "https://www.g2.com/products/imaginit-technologies/reviews", "Review ID": 4420903, "Review Title": "NOT GIVEN", "Review Content": "residential projects, average 10 levels.\n\n\nautomation would be the best, then the variety of other apps from toolbar Utilities\n\n\nthe complexity for a new user that might damage files if not properly trained.\n\n\nContact Jamey Dempsey, he will assist anytime from anywhere so solve your issues.\n\n\nTime saver, reducing the need to hire interns to run time consuming simple tasks.", "Publish Date": "2020-10-13", "Author": "Eric S."}, {"Product Name": "Imaginit Technologies", "G2 Link": "https://www.g2.com/products/imaginit-technologies/reviews", "Review ID": 3758332, "Review Title": "NOT GIVEN", "Review Content": "It helps automate some mundane tasks we need to fix in our drawings - such and data entry/\n\n\nI like that I can pull in files from excel SOMEWHAT easily, and I love the simple change case tool.\n\n\nI wish it could be more integrated with excel - as in i could work directly in the excel file while im in revit...like a cloud based system.\n\n\nWithin Revit the product functions properly. If there are certain model maintenance issues you need to address and imaginit has them - it is a smooth tool to work with to solve those issues.\n\n\nRoom data entry in Revit can be easier to change when I use the excel files.", "Publish Date": "2019-11-26", "Author": "NOT GIVEN"}, {"Product Name": "Imaginit Technologies", "G2 Link": "https://www.g2.com/products/imaginit-technologies/reviews", "Review ID": 3776675, "Review Title": "NOT GIVEN", "Review Content": "Using Clarity to automate tasks\n\n\nEase of use in setting up tasks to automate processes.  We have saved hours of time automating tasks that previously were manually.\n\n\nSome features that would make sense currently missing\n\n\nSpend the time to read the documentation to understand setting up tasks.\n\n\nAutomating repetitive tasks.  Our employees can now automate the tasks that considered boring and can now focus on work that is more enjoyable.", "Publish Date": "2019-12-02", "Author": "NOT GIVEN"}, {"Product Name": "Dimension Data", "G2 Link": "https://www.g2.com/products/dimension-data/reviews", "Review ID": 7686273, "Review Title": "NOT GIVEN", "Review Content": "The only thing I liked about them was Flexibility in workplace\n\n\nThey had alot to dislike. First, management are very unreasonable and have very high expectations. We used to work excessively more hours than expected, especially towards month ends. Their payment is meager in comparison to industry standards and never in time.\n\n\nI can't recommend them to anyone. They are very disappointing!\n\n\nNone. They need a lot of improvements, especially in the management", "Publish Date": "2023-02-07", "Author": "Dickson W."}, {"Product Name": "Dimension Data", "G2 Link": "https://www.g2.com/products/dimension-data/reviews", "Review ID": 7686354, "Review Title": "NOT GIVEN", "Review Content": "Bright future for Technology\nNice Atmosphere\nContinue to look to be on the cutting edge\nHas combined with a number of companies to leverage expertise and experience\nExcellent Flexibility\nContinuous Education\n\n\nI can't think of any. They have a great work-life balance\n\n\nDefinitely, I recommend Dimension data to others who have various professional help required in one place.\n\n\nAll Technologies and Techno-functional problems have been resolved", "Publish Date": "2023-02-07", "Author": "Linnet K."}, {"Product Name": "Dimension Data", "G2 Link": "https://www.g2.com/products/dimension-data/reviews", "Review ID": 972215, "Review Title": "NOT GIVEN", "Review Content": "Our project focused on utilizing data to determine new features that may be resourceful for our new system implementation and procedures. Primarily focusing on user-friendly attributes and analysis.\n\n\nThe best aspect of this technology is that it allowed the organization to be able to obtain solid data that was accurate and simple. We were able to easily find the issues with our database by gaining statistical models and arithmetic information from this tool.\n\n\nThe only issue is that the system was most effective for our internal issues rather than being able to expand to a larger network for data analytics.", "Publish Date": "2018-10-16", "Author": "NOT GIVEN"}, {"Product Name": "SoftwareONE", "G2 Link": "https://www.g2.com/products/softwareone/reviews", "Review ID": 7655686, "Review Title": "NOT GIVEN", "Review Content": "Some of the most helpful features and benefits include:\n\nComprehensive Services: SoftwareONE offers a wide range of services, including software licensing, procurement, and management, cloud solutions, digital transformation services, and cybersecurity solutions. This helps organizations get everything they need in one place, reducing the time and effort required to manage their technology.\n\nExpertise: SoftwareONE has a team of experts who are knowledgeable in all aspects of technology management and optimization. They provide valuable insights and recommendations to help organizations achieve their desired outcomes.\n\nProven Track Record: SoftwareONE has a proven track record of success, with a large number of satisfied customers and a solid reputation in the industry.\n\nEase of Use: SoftwareONE provides easy-to-use tools and processes that make it simple for organizations to manage their technology and optimize their investments.\n\nCost Savings: By working with SoftwareONE, organizations can reduce their costs, avoid licensing compliance issues, and optimize their technology investments.\n\n\nPricing: Some users may find the pricing for some of SoftwareONE's services to be higher than other options in the market.\n\nComplexity: Depending on the services being used, some users may find the processes and tools provided by SoftwareONE to be complex or difficult to navigate.\n\nLimited Availability: SoftwareONE may not be available in all regions or countries, which could be a disadvantage for some organizations.\n\nThese are some potential downsides of using SoftwareONE, however, these may vary depending on the specific needs and requirements of the organization.\n\n\nEvaluate your organization's technology needs, challenges and goals.\nCompare pricing with other options in the market.\nGet references from organizations that have used SoftwareONE.\nUtilize SoftwareONE's team of experts.\nTest the tools and processes offered by SoftwareONE.\n\n\nSome of the key problems that SoftwareONE addresses include:\n\nSoftware Licensing: SoftwareONE helps organizations manage their software licensing, ensuring they are fully compliant and avoiding the risk of costly fines.\n\nTechnology Procurement: SoftwareONE offers a one-stop-shop for technology procurement, making it easier for organizations to purchase and manage the software they need.\n\nCloud Solutions: SoftwareONE provides cloud solutions that help organizations optimize their technology investments and transition to the cloud.\n\nDigital Transformation: SoftwareONE offers digital transformation services to help organizations modernize their technology and processes, enabling them to stay ahead of the competition.\n\nCybersecurity: SoftwareONE provides cybersecurity solutions to help organizations protect their systems and data from cyber threats.\n\nBy addressing these problems, SoftwareONE is helping organizations optimize their technology investments, reduce their costs, and achieve their desired business outcomes. As an IT support technician, I benefit from having a trusted partner like SoftwareONE to help me support my clients in their technology journey.", "Publish Date": "2023-03-28", "Author": "Ryan N S."}, {"Product Name": "SoftwareONE", "G2 Link": "https://www.g2.com/products/softwareone/reviews", "Review ID": 7885315, "Review Title": "NOT GIVEN", "Review Content": "Signal point to manage the software and cloud compliance with effectively.\n\n\nLimited with the few regions otherwise best solution for organizations.\n\n\nSoftwareOne help us to design and implement the new technology with cost effective.", "Publish Date": "2023-04-06", "Author": "Gajendra R."}, {"Product Name": "SoftwareONE", "G2 Link": "https://www.g2.com/products/softwareone/reviews", "Review ID": 7348555, "Review Title": "NOT GIVEN", "Review Content": "I like software helping much in digital way of platform\n\n\nLong meetings, documentation,writing the sme code repeatedly, last minute changes in final software.\n\n\nAdvice that come faster then more faster\n\n\nSoftware were helping in many conditions of internet work", "Publish Date": "2022-11-11", "Author": "GAURAV K."}, {"Product Name": "SoftwareONE", "G2 Link": "https://www.g2.com/products/softwareone/reviews", "Review ID": 6593374, "Review Title": "NOT GIVEN", "Review Content": "I used SoftwareOne for software life cycle management and technical support of SAM solution.\n\n\nSoftwareOne is best in the industury which helps in design and implement technology startergy.  Really loved and satisfied with their services at this point of price.\n\n\nSometimes it is hard to find the desirable solution in accordance to the business needs in desirable time, if they could provide solution on time in accordance to your need only then it would be great\n\n\nUsed SoftwareOne for software lifecycle management and for some performance upgradation.", "Publish Date": "2022-05-10", "Author": "Himanshu J."}, {"Product Name": "SoftwareONE", "G2 Link": "https://www.g2.com/products/softwareone/reviews", "Review ID": 591834, "Review Title": "NOT GIVEN", "Review Content": "Software one is our third party vendor for software.\n\n\nThey charge reasonably for the software, very quick in responding and deliver on time.\n\n\nI like everything about software one. They provide very good customer service.", "Publish Date": "2018-01-26", "Author": "NOT GIVEN"}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 9020531, "Review Title": "NOT GIVEN", "Review Content": "IBM is really helpful everytime we got problem with logic and integration. They are able to create feature that suit to our requirements. The implementation timeline is reliable and achieveable. Easy to access,  anytime we need consultation. Thats why we engage them multiple times. especially frequently for SAP product, more than three times we use their services.\n\n\nThe price is a bit  higher than others. Not all IBM team is serve with heart, so you need to be selective to choose the IBM resources it self.\n\n\nIf you are looking best services consultant to implement SAP products and the budget is not a problem, choose IBM.\n\n\nImplementation of SAP Group Reporting and SAP S4 Hana", "Publish Date": "2023-12-16", "Author": "M. Wildan S."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 8880589, "Review Title": "NOT GIVEN", "Review Content": "That is there are different type of people with different views and knowledge about consulting on different types of projects that has been done in the company before.\n\n\nThe detailed information provided at times by their associates is not always accurate to the exact point.\n\n\nAlways have in detail the information needed for a project.\n\n\nPlanning when having a project or when consulting information in how to proceed with a project.", "Publish Date": "2023-11-15", "Author": "Mauricio S."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 8404320, "Review Title": "NOT GIVEN", "Review Content": "IBM consulting helps id process and develop the business, they use technologies in the modenerize way and the software which is developed here are used in different industries.\nI am also using  one of them.\n\n\nThere is nothing to dislike about IBM consulting.\nI am. They always  help us to identify the problems and then they identify the cause after that provide a better solution. So there is nothing to dislike.\n\n\nI would like to recommend others/business to use IBM consulting.\n\n\nIBM consulting solving the problem in a great way, they use linear process in their work. First they identify the problems and then they identify the cause after that provide a better solution.", "Publish Date": "2023-08-04", "Author": "Neha Y."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 8372723, "Review Title": "NOT GIVEN", "Review Content": "Knowledge of products and staying up to date with the latest technology.\n\n\nSome areas of expertise aren't as strong as others from my experience. Ex. would the options for cloud calling.\n\n\nIBM Consulting is a strategic partner that helps modernize others businesses, the issues I have is reach, which IBM helps solve with their large consulting team.", "Publish Date": "2023-09-13", "Author": "Naveed M."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7734367, "Review Title": "NOT GIVEN", "Review Content": "They have unparalleled experience and are problem solvers. We have great faith in them and their abilities to safeguard our critical data and develop a solution that will help us succeed. Bluewolf's crew is adaptable, communicative, and professional. His background was obvious, as was his familiarity with Salesforce and AccountingSeed. Our team was really pleased with how well the Bluewolf team collaborated with us. A important element for me is that they keep the project moving, keep me continually updated, and give regular and comprehensive progress communication. His thinking leadership and drive aided us in developing the finest possible solution for our company.\n\n\nThere isn't much to \"dislike\" about us. Working with Bluewolf has been a very pleasant and productive experience. In terms of the AccountingSeed project, we had nothing but positive things to say about Bluewolf; they were responsive throughout the collaboration.\n\n\nThis is the product and people to make it happen for any business that wants to take it to the next level. Bluewolf may be trusted since they have experience in a variety of sectors and will listen to your specific wants and rules. Bluewolf provided an appropriate solution for us because they understand how important time is to our organization. They take the time to understand your business requirements and tailor the solution to those requirements, all while keeping the project organized and on track.\n\n\nWe lacked the capacity to integrate our ERP, Finance, Accounts, and other systems. Our data was spread across many platforms, making it difficult to maintain efficiency. Basic chores become too difficult and time-consuming. Our everyday duties have been simplified and linked. Our workers and clients can now interact more efficiently, and all of our data is in one location. We were able to build automation with Salesforce to speed up typical activities, and we can now instantaneously access our accounting information in one coherent system.", "Publish Date": "2023-02-19", "Author": "Stephen S."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7641000, "Review Title": "NOT GIVEN", "Review Content": "The clarity with which they delivered the support\n\n\nSometimes they take time to respond to requests.\n\n\nIt is a service with which you will feel calm and accompanied\n\n\nSupport on the development of applications in IBM BPM. Also support on the IBM Integration Bus.", "Publish Date": "2023-09-18", "Author": "Jairo Andres V."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 8349554, "Review Title": "NOT GIVEN", "Review Content": "They are a well-established and reputable company with decades of experience. They are also innovative and stay upfront with emerging technologies. Lastly, IBM reach is global.\n\n\nCost, IBM is generally on the higher end in pricing. The consumer must be specific on the packages they are to avail due to IBM's various offerings in services.\n\n\nClearly define your objectives for the services you want to purchase. You may also request case studies and references.\n\n\nIBM helped out business navigate the complexities of digital transformation by leveraging emerging technologies such as AI and Digital Twin. It also helped us with data management and analytics.", "Publish Date": "2023-07-23", "Author": "NOT GIVEN"}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 8370481, "Review Title": "NOT GIVEN", "Review Content": "Simple and easy to use software. Not very complex to use for a first time user\n\n\nUI can be made more jazzy so that it will attract more users\n\n\nIt easily helps in taking business decisions by prociding impactful insights.", "Publish Date": "2023-07-28", "Author": "Harish J."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7645974, "Review Title": "NOT GIVEN", "Review Content": "They are experts in their area; they have a talented group of consultants who can come up with creative solutions for your business. They ultimately benefit you with their expertise in consultancy\n\n\nThey piled up projects and hence could not complete the project on time. It might have happened in my case only. Apart from that, they worked perfectly and provided us with the best solutions\n\n\nWith my experience with them, I would certainly recommend Bluewolf for consulting works\n\n\nBluewolf helped us to implement salesforce in my former e-commerce startup company. They had an excellent team of project managers and developers who guided us technically and responded well to solve the problems", "Publish Date": "2023-01-27", "Author": "Ansuya B."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7632263, "Review Title": "NOT GIVEN", "Review Content": "The vast knowledge of the team is impressive. While I found IBM's team a little stuffy initially, they came around through longer conversations and it was clear that they hire people committed to knowing their industry well.\n\n\nThey steer you rather strongly toward their own solutions, which I sometimes found lacking. Obviously, they believe in their tech, but if I've already told them that I prefer a different solution, they should work that into our project and not keep insisting that we bring their solutions in. I found this disrespectful.\n\n\nIBM Consulting Services is a solid choice for companies looking for experienced and knowledgeable consultants. Their team has a wealth of industry expertise and they are able to provide valuable insights and guidance to clients. However, while they are reliable and competent, they may not always bring the most innovative thinking to the table. IBM Consulting Services is a dependable option for those looking for experienced professionals to help them achieve their business goals.\n\n\nWe were looking at their solutions in respect to the company's use of SAP products and possible solutions that could be a hybrid model where we uses some IBM and some SAP solutions.", "Publish Date": "2023-01-24", "Author": "NOT GIVEN"}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 8175031, "Review Title": "NOT GIVEN", "Review Content": "Product Maturity and Solution depth\nIndustry leading products capability\n\n\nHigh cost of product licensing\nCost effective solutions\n\n\nCheck Industry solutions capability\n\n\nIndustry 4.0", "Publish Date": "2023-06-03", "Author": "Amit B."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7879008, "Review Title": "NOT GIVEN", "Review Content": "IBM Consulting is a very organized team\n24/7 availability of team\nLower cost for the project\n\n\nLess involvement of top level management in project.\n\n\nIBM helped us to Implement SAP CRM. The project was smooth without any hustle; IBM deployed proper planning and the highly skilled person. Overall excellent experience with the IBM team.", "Publish Date": "2024-01-29", "Author": "Rajiv T."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7631058, "Review Title": "NOT GIVEN", "Review Content": "Prepared and trained personnel. They show expertise in each of the steps, and they go that extra mile to be certain that they've found the right solution, even if it's not his/her area.\n\n\nThe process tends to be a little long. Each step requires a lot of time, meetings, and areas involved.In the end, they always hit the nail in the head, but I wish it was in a little less time.\n\n\nTry to be on top of the overall process, in order to shorten resolution times.\n\n\nOutsourcing\nSystem Transformation\nBusiness Consulting\n\nThe first thing is having a  good discovery of the situation, something that maybe we didn't perceive, then addressing it accordingly.", "Publish Date": "2023-07-25", "Author": "NOT GIVEN"}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7643135, "Review Title": "NOT GIVEN", "Review Content": "User-centered experience design.\nLightning experience.\nSales Cloud.\nCommunity cloud.\nServices are too good.\n\n\nScheduling project is some how difficult.\nIt is liitle bit expensive.\nIts hard to use at first.\n\n\nIssues will be resolved soon with customer support.\n7summit empowers customers.\nServices are completed within the correct timeframe.\nServices completed on budget.", "Publish Date": "2023-01-30", "Author": "DWARAMPUDI T."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7630747, "Review Title": "NOT GIVEN", "Review Content": "Solid salesforce expertise, trusted advisers, and engaged consultants.\n\n\nHigh Cost for small organizations, difficult to use for bigneers.\n\n\nBluewolf team showed best practices and planned how to change from our current workings with business process documentation, maintain our deadlines, make better decisions and service our clients.", "Publish Date": "2023-01-31", "Author": "Aniket S."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7639044, "Review Title": "NOT GIVEN", "Review Content": "They did a deep dive to identify all of the factors impacting business results.\n\n\nThey weee not necessarily clear in how to best\nImplement their proposed strategy, but we weren't sure we would be implementing it in the first place.\n\n\nThey are worth considering depending on the nature of the Consulting engagement being considered.\n\n\nIBM Consulting was engaged to identify opportunities to turnaround the business in a tough retail environment.", "Publish Date": "2023-01-25", "Author": "NOT GIVEN"}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 6737284, "Review Title": "NOT GIVEN", "Review Content": "Commitment, consulting experience, and brilliant people are always seeking your satisfaction and business impact. Response times of their assistance are pretty good.\n\n\nSupport may come from a mixture of experienced and inexperienced support team members therefore sometimes at first contact it may take some time to understand what is the request and how to proceed.\n\n\nKeep communication active and clear. Always think twice about your requirements before making decisions. That will save you a LOT of time that can be spent on improving your business.\n\n\nBluewolf provides consulting services and strategies to connect their clients with their customers by taking advantage of industry-leading technologies like Salesforce.", "Publish Date": "2022-07-11", "Author": "Jonas P."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7149555, "Review Title": "NOT GIVEN", "Review Content": "Their working team is the best & the way they are responding is awesome.\n\n\nNothing to dislike. Their resources are awesome.\n\n\nYou can trust their services without any other thoughts. They providing the best consultancy services.\n\n\n7 summits provides the Salesforce consulting services. They are trustworthy and provides you the smooth & better service.", "Publish Date": "2022-10-07", "Author": "Rk T."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7074267, "Review Title": "NOT GIVEN", "Review Content": "IBM is oldest IT company and has decades of experience to provide services in the various field of Information Technology and IBM is one of the major Research and development company in the word\n\n\nI couldn't observe any such cons while working with IBM Global services except cost is too than other\n\n\nIBM is big tech company which provides you all types of services including all type of  cyber security services and IT Infrastructure\n\n\nIBM Global Business services solving various type of IT Infrastructure and Software Development and Software Customization as well as provide cloud based services.", "Publish Date": "2022-09-05", "Author": "NOT GIVEN"}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 7078397, "Review Title": "NOT GIVEN", "Review Content": "Customized solutions with focus on customer satisfaction. Always customer is the king with maintained confidentiality and providing innovative solutions with focus om quality.\n\n\nNeed support for maintenance after project is delivered.\nFor a change in requirement in-between the project need to rework on Solution.\nUsage of agile methodologies during development should work.\n\n\nHighly recommend for getting quality and innovative solutions.\n\n\nProviding smart solutions with an open way of working by bringing a diverse set of voices and technologies together.  Apply breakthrough innovations that drive exponential impact to change how business gets done.", "Publish Date": "2022-09-07", "Author": "NOT GIVEN"}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 5254635, "Review Title": "NOT GIVEN", "Review Content": "They helped us in implementing Workday Human Capital Management, Learning management, reports, integrations, etc. Lots of training material was developed.\n\n\nThe resources from IBM are very knowledgeable in the workday. They conducted several working sessions to understand our business needs and were able to help us in this journey.\n\n\nSome people who know PeopleSoft HCM and Workday HCM would have helped more effectively. The technology and functionality between these two are different, and their experience would have been more helpful; they had a hard time with integrations between PeopleSoft FSCM and Workday HCM.\n\n\nThey converted PeopleSoft HCM into Workday HCM, developed integrations between PeopleSoft FSCM and other third-party vendors on time. Users are happy with the workflow/business process, paperless approvals, Hiring process is seamless, end to end process of Hire to Retire is very easy for the HR partner to the hiring manager.", "Publish Date": "2022-01-06", "Author": "NOT GIVEN"}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 5463987, "Review Title": "NOT GIVEN", "Review Content": "OS upgrade\n\n\nTheir knowledge is excellent.  They are friendly and patient with us to make changes and work on projects together. They give feedback and extra information pertaining to the subject.\n\n\nThe IBM website is vast and hard to find the correct documentation.  Some documentation is very long and tedious.  Very time consuming to read through it.\n\n\nCurrently working on their ACS app to work out some bugs.", "Publish Date": "2022-03-28", "Author": "NOT GIVEN"}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 6499118, "Review Title": "NOT GIVEN", "Review Content": "The ability to communicate\n\n\nI believe the features utilized are extremely valuable in a team environment\n\n\nThe only thing that needs to be improved is the UI\n\n\nCommunication would be the main achievement of IBM Services", "Publish Date": "2022-04-12", "Author": "NOT GIVEN"}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 5054101, "Review Title": "NOT GIVEN", "Review Content": "Renovacion de servidores power systems AIX\n\n\nLa alta disponibilidad por medio del vios de power vm\n\n\nComplejidad en la migracion de AS400 a esta nueva plataforma\n\n\nEs importante asesorarse correctamente con los mayoristas y el fabricante para poder licenciar los productos de IBM correctamente\n\n\nFalta de capacidad de recursos de procesamiento que teniamos tanto en CPU como en RAM del antiguo AS400 que trabajaba IBM rational para el desarrollo del ERP", "Publish Date": "2021-10-13", "Author": "Mauricio R."}, {"Product Name": "IBM Consulting", "G2 Link": "https://www.g2.com/products/ibm-consulting/reviews", "Review ID": 5217915, "Review Title": "NOT GIVEN", "Review Content": "Transitioning data and work products to the cloud.\n\n\nEase of use and ability to merge disparate data sources into one.\n\n\nCan be tedious and need personel with platform knowledge.\n\n\nData migration, data analytics, patient data.", "Publish Date": "2021-12-20", "Author": "Pablo s."}, {"Product Name": "Crayon", "G2 Link": "https://www.g2.com/products/crayon/reviews", "Review ID": 8213152, "Review Title": "NOT GIVEN", "Review Content": "The team assessed our company initially on how to make the process and the benefits it'll bring us. The team was very friendly and answered patiently our questions timely.\n\n\nThe company was very impressed with Crayon and they had no objections. Plus they needed to start cloud storing for the company's requirements. I would say maybe more presence of Latin companies in the rooster or perhaps offices in Latam to secure more presence in the Latin market if that's something they're interested in.\n\n\nHave IT people to reach out to them and explain in detail the processes, don't ask people that are not familiar with the jargon or with basic knowledge to meet with them because they'll end up confused, it's extra work for you and them as well.\n\n\nMoving to a cloud storage model in the company I used to work with, with Crayon we're assessed on how to make the transition and we're actually recommended by a colleague in Croatia from another branch that used Crayon.", "Publish Date": "2023-06-13", "Author": "Neyla Vanessa P."}, {"Product Name": "Crayon", "G2 Link": "https://www.g2.com/products/crayon/reviews", "Review ID": 8278891, "Review Title": "NOT GIVEN", "Review Content": "The way Crayon's digital expert trained to onboard the latest versions is exterely professional without wasting the time of our resources and helped us to stay a step ahead.\n\n\nThe suite of offers is very limited and dependent on another third party for their offerings. So the knowledge base are platform dependent and builds a dependency.\n\n\nGive it a try!\n\n\nWe can manage your teams digital transformation journey by partnering with the experts from Crayon, who are extremely helpful when exploring new features when ever a new release is there.", "Publish Date": "2023-07-03", "Author": "Anish Kumar  D."}, {"Product Name": "Crayon", "G2 Link": "https://www.g2.com/products/crayon/reviews", "Review ID": 7665356, "Review Title": "NOT GIVEN", "Review Content": "I do not have to spend much time researching a specific topic to gain the information, as I can use Crayon to get the information in a short amount of time, and it is also very easy to search for the information I am looking for without much hassle.\n\n\nI can not think of anything that I dislike about Crayon because it got all the features that are required and it does the job for me perfectly without an issue.\n\n\nIf you are looking for a tool that provides information about your industry competitors, then this is a must-have tool in your system and this also won't take much time to get the information\n\n\nWe use Crayon to gather much indeed information and the latest news about the competitors in the industry, along with that we also use different solutions provided by Crayon such as Adobe Acrobat", "Publish Date": "2023-02-02", "Author": "Rupesh K."}, {"Product Name": "Crayon", "G2 Link": "https://www.g2.com/products/crayon/reviews", "Review ID": 8265002, "Review Title": "NOT GIVEN", "Review Content": "Their services are very much based on all the new technology like cloud and analytics, which use AI and reliable data. Their customer support and onboarding process is smooth\n\n\nI think Crayon should look at how they can onboard more social media platforms, like LinkedIn. Even their emails about various insights re good but can be made better\n\n\nCrayon has good products and services to help businesses transform into digital businesses. Their cloud-based approach helps users/on boarders to embrace the new technology of today seamlessly", "Publish Date": "2023-06-28", "Author": "NOT GIVEN"}, {"Product Name": "Crayon", "G2 Link": "https://www.g2.com/products/crayon/reviews", "Review ID": 7657663, "Review Title": "NOT GIVEN", "Review Content": "Their team's competence and their services.\nCrayon's staff has unparalleled skills and experience in offering technology and digital transformation solutions.\n\n\nTo the best of my knowledge, there are none.\nBecause it can be tailored to meet the specific requirements of each customer, Crayon is an excellent choice for any corporate transformation solution.\n\n\nIf you're looking for a digital transformation solution that's grounded on actual data, Crayon is the business for you. They concentrate on generating genuine outcomes for their clients and adopt a results-driven strategy.\n\n\nTheir services include IT strategy consulting, cloud computing, digital experience design, and more.\nCrayon differentiates itself from other technology and digital transformation organizations by emphasizing tangible outcomes. They emphasize results-driven customer value.", "Publish Date": "2023-01-31", "Author": "Godfrey C."}, {"Product Name": "Crayon", "G2 Link": "https://www.g2.com/products/crayon/reviews", "Review ID": 7655670, "Review Title": "NOT GIVEN", "Review Content": "It is stable and great platform, no downtime encounterd. Drafting, publishing, and sharing intelligence with our internal team is simple. It's great toold and support team is excellent.\n\n\nThis is really amazing using crayon and nothing to dislike. Sometimes this tool is buggy and hanging and nothing else. Else everything looks and works fine for me.\n\n\nI appreciate that the crayon support team and our customer service representative rapidly address any questions I have. And it assists us grasp what we are lacking or record a suggestion for a future products improvement.", "Publish Date": "2023-01-31", "Author": "NOT GIVEN"}, {"Product Name": "Crayon", "G2 Link": "https://www.g2.com/products/crayon/reviews", "Review ID": 5337915, "Review Title": "NOT GIVEN", "Review Content": "We use Crayon to provide competitive intelligence to our teams automatically. This information allows us to identify opportunities in which we can exploit competitive advantages or differentiate our products and services from the competition,\n\n\nI like that this information is delivered to my inbox automatically. I don't need to visit a page or mine the data continually. It comes to my inbox on a regular schedule so that I can act on the data quickly.\n\n\nNeeds more robust how-to documentation on how to use various features. Especially recommendations around best practices.  I would also like to see some more advanced analytics capabilities in Crayon. Finally, it's tough getting some teams to review and act on the information. This problem is not a Crayon issue but indeed a cautionary tale for anyone considering incorporating competitive intelligence into their organization. Make sure that review and action become part of the normal process.\n\n\nMake sure that you have a process in place to have the team regularly review and act on the information.\n\n\nOur organization is using Crayon to get competitive intelligence into the hands of our teams quicker and more efficiently than if they were mining the information on their own. We've been able to respond to changes in the marketplace more quickly and have much more detailed battle cards available to our sales team.", "Publish Date": "2022-02-22", "Author": "Mike M."}, {"Product Name": "Crayon", "G2 Link": "https://www.g2.com/products/crayon/reviews", "Review ID": 6735075, "Review Title": "NOT GIVEN", "Review Content": "easy to use/ can search and easily find anything\n\n\nHonestly i cant think of any- we enjoy the tool\n\n\nif you want a simple tool for everyone to understand this is it\n\n\nyou can easily search for anything- my sales team faces objections and can find the answers within seconds- very simple tool", "Publish Date": "2022-06-14", "Author": "Haley D."}, {"Product Name": "Crayon", "G2 Link": "https://www.g2.com/products/crayon/reviews", "Review ID": 4952069, "Review Title": "NOT GIVEN", "Review Content": "When I am on a work call - and a client says they are looking at our competitors - I know how to position my calls because of Crayon. It has all the information I need to know about our competitors all in one spot. It shows me what I should talk about on my calls for each competitor.\n\n\nI like that I can find information about our competitors so quickly. I don't have to do a ton of research because it is all right there.\n\n\nThere isn't anything I dislike in Crayon. I can do everything I need to in the system.\n\n\nIf you don't have a spot for your employees to view information about your competitors - then this is a great system for you!\n\n\nBefore Crayon - it was taking me so much time to find information about our competitors. The most significant benefit of Crayon is that I am saving so much time. I also know how to position my calls because of Crayon.", "Publish Date": "2021-09-08", "Author": "NOT GIVEN"}, {"Product Name": "Crayon", "G2 Link": "https://www.g2.com/products/crayon/reviews", "Review ID": 5003003, "Review Title": "NOT GIVEN", "Review Content": "It's helping us gather competitive intel and news happening in our industry. It is also pushing in real-time sentiment from G2\n\n\nI like that it surfaces relevant content for us and allows us to share intel we are hearing from our prospects\n\n\nWe have a lot of content in Highspot that can be pushed to salesforce automatically depending on the competitor we are facing. So there is no benefit to have an additional tool to cover competitive intel when we have battles cards and decks built out in Highspot for ammo\n\n\nWe didn't have a problem strategizing on competitive", "Publish Date": "2021-09-15", "Author": "NOT GIVEN"}, {"Product Name": "Crayon", "G2 Link": "https://www.g2.com/products/crayon/reviews", "Review ID": 4702155, "Review Title": "NOT GIVEN", "Review Content": "I work in sales and understanding the competitive landscape is crucial.\n\n\nI like how quickly I can find the information that I am looking for.\n\n\nIt requires an admin to keep the info updated, so sometimes I have to be cautious about the info that I gather from the tool.\n\n\nI am solving the problem of being able to speak confidently about how my product differs from that of the competition. I am able to show up to calls prepared with how our product is superior and speak to the nuances of our product vs. another solution.", "Publish Date": "2021-09-09", "Author": "NOT GIVEN"}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 9045809, "Review Title": "NOT GIVEN", "Review Content": "- skilled employees with good experience.\n- they go the extra mile to deliver value.\n- ability to manage 3rd party resources.\n- more local resources than other firms.\n\n\n- pricing can be higher than average.\n- highly matrixed organization.\n\n\nMake sure to include some performance and/or outcome  based payment structure in the SOW/contract.\n\n\nSAP implementation. Helps to have experts who have been there, done that.", "Publish Date": "2023-12-21", "Author": "NOT GIVEN"}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 8316016, "Review Title": "NOT GIVEN", "Review Content": "The career opportunities, list of clients and development learnings gives this organization a thumbs up.\n\n\nBeing one of the best places to work for, CTS is no exception when comes to layoff's.\n\n\nYou need a challenging place to work for, then CTS is the organization.\nYou need to upskill and be on constant learning to advance your career, then CTS is the organization.\nIf you plan to go onsite to work for, then CTS is the organization to look for.\n\n\nThey are into consulting and Technology services offering a portfolio of services to fortune 500 companies.", "Publish Date": "2023-07-13", "Author": "Subramanyam G."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 8568215, "Review Title": "NOT GIVEN", "Review Content": "The talent expertise and the commercial flexibility that is offered has allowed us to do the business with ease\n\n\nLaegely all our things got sorted around cloud migration to Google Cloud. However we were looking for innovative strategies that can help us boost our business on cloud which we couldn't find\n\n\nWe were trying to migrate to cloud and wanted one service provider to helps us in the task. We wanted to move from our data center business to cloud. We have realised greater operational efficiency and reduced operational costs", "Publish Date": "2023-09-05", "Author": "NOT GIVEN"}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 8318245, "Review Title": "NOT GIVEN", "Review Content": "1. Culture\n2. Internship\n3. Equality\n4. Morality\n5. No bond\n\n\nCan improve recruiting the candidates by based on the skills and not by experience.\n\n\nBest organisation for freshers to start the carrier.\n\n\nHelping many associates with lot of opportunities work with organisation as intern and full time work.Initially they are providing training that helps us to cope with the organisation work as a first step.", "Publish Date": "2023-07-16", "Author": "Syed Mohammed I."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 8249713, "Review Title": "NOT GIVEN", "Review Content": "It's mission and values and its ability to change and adapt to the environment and client needs which is needed. The vision is the best and don't know how competitors rate.\n\n\nNobody has called me for a position and given me a chance when I'm qualified.don't know mich about this solution but perhaps I can offer fresh ideas given my industry knowledge and experience.\n\n\nKeep up with industry standards\n\n\nBeing transparent about the interview process which lets me know where I stand. I am more productive in applying for job positions. Don't know how performance has increased.", "Publish Date": "2023-06-23", "Author": "NOT GIVEN"}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 7640358, "Review Title": "NOT GIVEN", "Review Content": "The cost model was transparent and fully professional, and we never had to worry about the verification of the bill raised. All of the tasks were performed on time. Regular monitoring of task was done by CTS client manager.\n\n\nThe attrition rate in CTS was very high, so most of our resources/client relation managers / SPOCs used to get changed very frequently. Later on, we also felt the quality of tasks was degraded due to more focus on target over quality\n\n\ngood for scaling, cost-effectiveness and task which is actually not related to your core business activities\n\n\nOur company was looking for a service provider who could file regulatory filings and compliances on our company's behalf. And CTS helped us in doing that activity.", "Publish Date": "2023-01-26", "Author": "Ajit S."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 7788146, "Review Title": "NOT GIVEN", "Review Content": "Initial salary. I heard that the salary is good.\nGood onsite opportunity.\nMany of my friends are settled in usa and European who went there via cognizant.\nPure IT services company.\n\n\nI understand it's not a retirement company.\nI don't know if anyone continue to work for long. Even their oldest working employees are kicked out during every reason .\n\n\nGood to work for short term financial gain or onsite opportunity.\n\n\nMostly into fintech.\nMost customer are from USA and few from Europe.\nSome operations in pharma industry IT support.\nNot a domain specialist company but mostly into fintech IT support.", "Publish Date": "2023-03-02", "Author": "Dipesh S."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 7499492, "Review Title": "NOT GIVEN", "Review Content": "I like the learning curve and the encouragement from the leadership.\n\n\nThere is nothing that I dislike but I believe the remuration could have been better.\n\n\nGo and work hard ..learn lot of thing and explore other teams work... You have a lot of scope to learn and teach people\n\n\nI have worked on DMP and analytics for a year and had a great learning experience. The leaders encourage you to learn new skill and back you ...", "Publish Date": "2022-12-15", "Author": "Chandra  P."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 7622760, "Review Title": "NOT GIVEN", "Review Content": "On Call Support and efficient in providing the resolution\n\n\nNot as of such but sometime the support pase duration is bit high, they should keep the client or customer informed at the other end.\n\n\nThe Solutions provided by Cognizant are best and on time\n\n\nCognizant provides excellent support and IT resolutions to keep our production up", "Publish Date": "2023-01-21", "Author": "Charu A."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 7790450, "Review Title": "NOT GIVEN", "Review Content": "Cognizant technologies one of the leading IT company and  provide good work life balance\n\n\nNothing Cognizant technologies one of the best\n\n\nCognizant technology on of the best company to work", "Publish Date": "2023-03-03", "Author": "Santhanabharathi B."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 7647372, "Review Title": "NOT GIVEN", "Review Content": "All the teams are proactive in implementing the solutions as per the requirement and supports on resolving the issues.\n\n\nThere is nothing to dislike. I would always recommend to follow agile.\n\n\nOne of the best, well streamlined methodology in implementation of the design and solution.", "Publish Date": "2023-01-28", "Author": "Nihil kumar T."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 7490341, "Review Title": "NOT GIVEN", "Review Content": "Smart engineers that are well skilled in their craft. Have subject matter expertise around the networking areas that we were testing at our last two companies where we have used Cognizant services.\n\n\nThe cost models of the Cognizant services systems often times do not adequately follow the industry cost model structures. It is something that must be negotiated very hard up front.\n\n\nStructure your deal correctly but you will get good service and engineering help.\n\n\nThey have consulting solutions that serve variety of software development and testing needs for applications and hardware. They provide us with a test team for our software product.", "Publish Date": "2022-12-13", "Author": "NOT GIVEN"}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 7631314, "Review Title": "NOT GIVEN", "Review Content": "Transparency. Cognizant is very transparent in learning and working with clients\n\n\nNeed to add more testing automation rather than using manual testing\n\n\nFor starting career, Cognizant is a good option for freshers\n\n\nGood learning curve, great client handling and customer centric", "Publish Date": "2023-01-24", "Author": "Manikandan R."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 6820323, "Review Title": "NOT GIVEN", "Review Content": "Cognizant spend a decent amount of time with us in the pre-mobilisation phase of the project to identify and prioritise our goals in order to meet our digital transformation milstones quickly.\n\n\nNothing to dislike. The projects undertaken and those in progress are running smoothly.\n\n\nCognizant helped us with our digital transformation whilst aligning to our overall business strategy. This included shifting the mindset of our workforce towards change for the good of our business and Adopting a DevOps and Agile way of working.", "Publish Date": "2022-09-08", "Author": "James H."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 7524675, "Review Title": "NOT GIVEN", "Review Content": "The IT support is brilliant and always has a resolution to the issue.\n\n\nGetting the right support team is a bit of a challenge.\n\n\nCognizant provides excellent support and IT resolutions to keep our production up.", "Publish Date": "2022-12-24", "Author": "NOT GIVEN"}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 6547761, "Review Title": "NOT GIVEN", "Review Content": "To turn our Old School Work Process into a 100% computerised Flow which Makes no mistakes.\n\n\nThe Switch to cloud was Very easy for us dur to Their Implementation Services.\n\n\nNo dislikes so far  They did a good Job.\n\n\nPerformance wise & support wise, their services are worth the Price\n\n\nAfter using their services and the web applications are said to be loading at twice the speed and the end user can see drastic changes in performance.", "Publish Date": "2022-04-26", "Author": "Abhijith D."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 6926327, "Review Title": "NOT GIVEN", "Review Content": "Speed, resource planning, location advantage\n\n\nresource skill gaps, high costs compared to the competition\n\n\nscope clarity, resource interviews in advance\n\n\nDIgital & IT solutions , Support systems in Healthcare , Consulting , sales and multiple BA aspects", "Publish Date": "2022-08-02", "Author": "NOT GIVEN"}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 4666632, "Review Title": "NOT GIVEN", "Review Content": "Cognizant was my client and I'm into a facilities team have served to Cognizant for 3 plus years as a senior executive\n\n\nWork environment and locations where in I have served to cognizant\n\n\nLow salaries and job securities and treat to the NBC's as a slaves\n\n\nPascale is less but employees attitudes are above the expectations", "Publish Date": "2021-03-30", "Author": "Mohammed S."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 4663593, "Review Title": "NOT GIVEN", "Review Content": "Google Ads and Bank support\n\n\nThe training provided to their internal staff is very adequate and comforting from a customer point of view\n\n\nAs an Organization, they are very vast. They could stream down to their major USPS.\n\n\nGo for it! Cognizant has its name and reputation based on their services. And they deserve to be there\n\n\nMajor issues pertaining to solutions to data and advertising. Due to their highly trained staff, the resolution TAT is very fast and that's a huge advantage as the clients are usually satisfied by a faster query response time.", "Publish Date": "2021-03-27", "Author": "NOT GIVEN"}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 3342650, "Review Title": "NOT GIVEN", "Review Content": "", "Publish Date": "2020-06-15", "Author": "Earl S."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 4676496, "Review Title": "NOT GIVEN", "Review Content": "Good IT company in India. Need more creativity and product design\n\n\nMany internal opportunities within company.\n\n\nNo hike, bonus, and no food, Too many processes\n\n\nYou will get to learn so many things in this fast-paced environment.", "Publish Date": "2021-04-07", "Author": "Vijay T."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 4341858, "Review Title": "NOT GIVEN", "Review Content": "You can see the Progress reports at commercial level. The system is complete and competitive. It is a creative software an users get comfortable easily. This software helped us to connect with our customers. It helped us to prioritize their needs. It helped us to understand our customers better. The product has many features that makes it a good choice. It helped us to manage all over operations efficiently. It is an excellent solution to all your customer management problems.\n\n\nCognizant service is a powerful marketing software.It is the best software for ongoing operational work. it has and continues to improve itself. It is a flexible software. It is a strategic marketing partner. They're better than a traditional IT partner.They put together a team of highly professional people. Their team is very hardworking.They're always looking for new ways to help the customers. The team is always looking for new ideas to help the customers and solve their issues.Their team engages with the customer in a highly professional way. It is more than what customers normally expect. They have been highly accommodating in a complex business environment.They defined business processes and management relationships in a highly professional way.They are committed to the welfare of their customers. They want to make sure that their customers are successful.It is useful and adapts very well to the needs of customers. It is easily customizable.\n\n\nIt a an expensive software for small companies. Other CRM softwares are not so expensive. The software isn't fast and the support isn't responsive.\n\n\nIt a good software with a lot of management features. It needs a little improvement. I had a positive experience with it and would recommend it to others.", "Publish Date": "2020-08-13", "Author": "Hernandez M."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 4672402, "Review Title": "NOT GIVEN", "Review Content": "Cognizant internal projects are very gud they will offer wide range of Technologies to freshers. Earlier it was well known for onsite opportunities but negitive part is job security\n\n\nJust because of onsite opportunities in cognizant\n\n\nJob security is important for everyone, but in cognizant jobs are not permanent\n\n\nFor freshers cognizant is good\n\n\nSalary hike and bonus is good in cognizant", "Publish Date": "2021-04-03", "Author": "NOT GIVEN"}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 4481587, "Review Title": "NOT GIVEN", "Review Content": "I was in a banking domain project which was used by many companies for the transactions.\n\n\nThe company is quite good and has a great work-life balance, the managers re quite friendly.\n\n\nNothing as much but sometimes the work gets too repetitive.\n\n\nI would recommend if the company could use more advanced technology and adapt them sooner. rest all is very good.\n\n\nI was a part of the QA team and helped the team to find out the issues in the application.", "Publish Date": "2020-11-19", "Author": "Rahul S."}, {"Product Name": "Cognizant", "G2 Link": "https://www.g2.com/products/cognizant/reviews", "Review ID": 4676758, "Review Title": "NOT GIVEN", "Review Content": "We were taking Software support services from Cognizant\n\n\nWork Ethics that Cognizant follows, provides a soft comfort zone to Customers\n\n\nNothing that I can highlight of which describes negativity for Cognizant\n\n\nThey are a wonderful firm to parter with.\n\n\nDevops related customer support activities for maximum attainable gain on effective utilization", "Publish Date": "2021-04-07", "Author": "NOT GIVEN"}, {"Product Name": "Sirius", "G2 Link": "https://www.g2.com/products/sirius/reviews", "Review ID": 4083222, "Review Title": "NOT GIVEN", "Review Content": "They have helped with a number of my network and camera projects\n\n\nI like that we can get on a call and work out what is needed; if more engineering is needed they are quick to get back to me with the results.\n\n\nI can't think of anything at the moment.\n\n\nGreat price on the equipment.", "Publish Date": "2022-01-28", "Author": "Troy R."}, {"Product Name": "Sirius", "G2 Link": "https://www.g2.com/products/sirius/reviews", "Review ID": 4082422, "Review Title": "NOT GIVEN", "Review Content": "Sirius is our business partner and vendor for technology solutions. Main projects were networking and system management related. We needed 3rd party expertise to advise us on available options, and validate our own suggestions. Every time we engage with Sirius, they guide us successfully from start to finish. And more importantly, when things happen unexpectedly, they Sirius always is available to quickly get things back on track. For us, a vendor that not only delivers what is requested, but goes above and beyond to provide additional context is important to the overall success and continuous education of the team.\n\n\nSirius is a company with lots of talent. Our main business contact is always willing to help and manages each time to bring the right talent around the table to make us successful as their client. In short, their expertise and skill set, combined with broad industry knowledge, makes them a valuable partner around the table.\n\n\nThere is nothing we dislike. We typically dislike being spammed till death by marketing and sales material, but Sirius is not doing this. Hence we experience the relationship as a mutually beneficial one\n\n\nSirius is a great one-stop shop for all IT needs. Initially a smaller scope vendor for us, their expertise and knowledge, coupled with broad market experience has increased their value and support as business partner significantly. Highly recommended vendor to build a relationship with.\n\n\nWe are solving technically complex projects with products, knowledge and services from Sirius. We have increased our system reliability, simplified ongoing system management and improved operational efficiency with Sirius as partner. Lastly, our investments are driving the value we expected that we had set as a goal for each project.", "Publish Date": "2020-01-28", "Author": "Maurice L."}, {"Product Name": "Sirius", "G2 Link": "https://www.g2.com/products/sirius/reviews", "Review ID": 4082528, "Review Title": "NOT GIVEN", "Review Content": "I'm not sure which one this might relate to... VMware licensing, EMC  storage, etc..?\n\n\nThe people -- I love our account manager, Lindsey Hamer and her technical counterpart Joel Cason.  Both are very good at their jobs and very attentive when needed.\n\n\nQuote turn-arounds could be faster.  I'm not sure if the delay comes from the Sirius side or the vendor side, but a lot of times quotes seem to take a lot longer than I would expect.\n\n\nI have found Sirius to be one of the better VARs in the area.  I wouldn't hesitate to consider them if you are looking.  They make sure you're getting the solution you need and not just the thing you thought you wanted.  I rely on them to make sure I'm not making stupid decisions and I rely on them to \"have my back\".\n\n\nSirius helps me with server and storage design and delivery.", "Publish Date": "2020-01-28", "Author": "NOT GIVEN"}, {"Product Name": "Sirius", "G2 Link": "https://www.g2.com/products/sirius/reviews", "Review ID": 4095008, "Review Title": "NOT GIVEN", "Review Content": "Configuration and purchase of new IBM Power 9 system.\n\n\nEasy to get answers.  Very helpful at transferring operating system licenses\n\n\nNothing.  Everything went as planned.  Quotes were accurate\n\n\nThe new system is up and running.  We have not had any issues since installing it in August.  It is really fast!", "Publish Date": "2020-01-30", "Author": "Lawrence C."}, {"Product Name": "Sirius", "G2 Link": "https://www.g2.com/products/sirius/reviews", "Review ID": 4081806, "Review Title": "NOT GIVEN", "Review Content": "Managed Services\n\n\nAllows our IT Department some freedom from the day to day processes and frees our time up for additional tasks.\n\n\nWe have not had any negative experiences with the Managed Services team.  If there are issues, we have them addressed and get back on track right away.\n\n\nManaged Services", "Publish Date": "2020-01-28", "Author": "NOT GIVEN"}, {"Product Name": "Sirius", "G2 Link": "https://www.g2.com/products/sirius/reviews", "Review ID": 4081858, "Review Title": "NOT GIVEN", "Review Content": "Deploy Meraki Equipment\n\n\nPersonnel is available during project and open to ideas from customer\n\n\nNot everyone is local always nice to work togeter in person\n\n\nLearning new technologies and implementing those solutions", "Publish Date": "2020-01-28", "Author": "NOT GIVEN"}, {"Product Name": "Sirius", "G2 Link": "https://www.g2.com/products/sirius/reviews", "Review ID": 8370, "Review Title": "NOT GIVEN", "Review Content": "Forsythe has been a company I have used for many years as a vendor and computer loan company.  Their prices are competitive and their support is excellent.\n\n\nLike all vendor's, sometimes it is easier to deal with the manufacturer or primary company, but they will prevent this.\n\n\nIf you are looking for a vendor I would recommend Forsythe, I have dealt with them as partners and as a customer, and in both situations I have been satisfied.", "Publish Date": "2012-11-16", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 7609493, "Review Title": "NOT GIVEN", "Review Content": "Skaled became part of our team. We worked with Andrew, our Skaled partner, on a continuous basis to where it felt like he was one of us. We were able to utilize his knowledge as a coach, an advisor, and an administrator to help us when we hit snags in the road. One of my favorite things during our time were roleplays and coaching conversations around outbound calls. It was great to have an extra set of ears helping you make small tweaks that created a big impact. This helped create confidence and pushed us to overcome call reluctance. He created checkpoints for accountability and helped keep the team moving forward.\n\n\nNot all companies are going to operate the same, and our process and industry need a special approach. I think the internal, historical approach and this new external, consultative approach could've used better alignment during the project. Reps were being coached one way by the external and advised differently by the internal. This led to overall gaps in fitting the new team into the current company mold.\n\n\nSkaled was helping to get our new Business Development team off the ground with a playbook, new rep coaching, and overall process design.", "Publish Date": "2023-01-18", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 7234161, "Review Title": "NOT GIVEN", "Review Content": "SKALED was very strategic and methodical in its approach to analyzing the potential market and then leveraged best practices to structure a rigorous approach to qualify and touch each of these prospects.\n\n\nWe had no issues with SKALED and it would be hard to find something we didn't like given the success of the program.\n\n\nDon't just leverage SKALED when you have issues with your sales process but for an analysis of what potential opportunities you might be missing.  They bring a consultative approach to an engagement can help not only identify issues with your current sales process but opportunities for you to pursue as well.\n\n\nSKALED helped us design and develop a lead generation program for a Fortune 500 client that helped us to reach out to tens of thousands of prospects and design a multifaceted qualification process for each lead.", "Publish Date": "2022-10-19", "Author": "David K."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 7303791, "Review Title": "NOT GIVEN", "Review Content": "Andrew is incredibly knowledgeable and experienced in the sales field and was also very willing to collaborate with myself, and the other BDR's to find any possible route to experience success.\n\n\nMy only comment here would be that there were sometimes product knowledge gaps between other BDR's and Andrew. However, despite the product knowledge gaps at times, Andrew was always willing to listen and learn just as much as teach.\n\n\nI would recommend Skaled, especially for any new BDR.\n\n\nSkaled was helping the development of the BDR program and the training the incoming BDR's to develop good professional sales practices. This job being my first sales role, Andrew has been crucial in helping me build my confidence as a sales professional.", "Publish Date": "2022-11-03", "Author": "Corey J."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 7018406, "Review Title": "NOT GIVEN", "Review Content": "- They can be as involved as you'd like, ranging from general high-level strategy discussions to helping daily as we figure out how to move specific deals through our pipeline.\n- Their consultants have built sales teams across multiple industries, giving them a unique breadth and depth of expertise to help us solve our challenges.\n- They also get hands-on in listening to many of our sales calls to give feedback on specific areas of our conversations that we can improve.\n\n\n- The level of commitment can vary by the consultant that you work with, so you have to make sure you find someone within the Skaled team that can match the commitment that you need\n- Some of the great services (like helping organize your technology stack) come as paid add-ons and I wish we were able to get the benefits of everything that could help our sales org within the first trial period!\n\n\n- Organizing our sales KPIs\n- Organizing our salesforce\n- Building and test a sales process\n- Modeling and forecasting sales success\n- Creating content for email outreach\n- Recommending a technology suite specific for our sales process\n- Strategizing on active deals and potential client correspondence\n- Showcasing successful examples from other companies that we can incorporate into our strategy", "Publish Date": "2022-08-22", "Author": "Colin W."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 7265995, "Review Title": "NOT GIVEN", "Review Content": "Skaled has a fantastic ability to meticulously evaluate the sales environment and identify the precise strategy to include, but not limited to, staffing personas and training approaches needed to engage qualified prospects. Their executives are dedicated and knowledgeable in all aspects of the sales arena.\n\n\nAll interactions with Skaled were positive, informative and accelerated the program.\n\n\nBe open to the growth and education that Skaled provides. Allow yourself to think outside the box to propel your business forward. In short, take full advantage of their expertise.\n\n\nSkaled assisted us in developing a strategy that created a unique and dynamic advanced account research program for a Fortune 500 company.", "Publish Date": "2022-10-26", "Author": "Jane F."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 7237592, "Review Title": "NOT GIVEN", "Review Content": "From day one SKALED dug in to understand the goals of the project and how it would affect the business. They worked diligently to put forth a fantastic strategy of execution to help improve overall KPIs and deliver a significant return on investment.\n\n\nI found nothing I disliked about working with SKALED.\n\n\nCome prepared to have not only a thorough analysis of your intended market done but to have a deep dive into other market potential uncovered.\n\n\nSKALED helped us design a project to increase ROI for one of our fortune 500 clients with deep levels of qualifications.", "Publish Date": "2022-10-27", "Author": "Kasey B."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 7655327, "Review Title": "NOT GIVEN", "Review Content": "Helpful with implementation and end-user training\n\n\nWould have like to see more depth to the engagement. Some parts of the implementation felt very 'cookie cutter'\n\n\nSkaled helped us with our Outreach implementation. The primary benefit we saw was successfully setting up our Outreach & CRM integrations", "Publish Date": "2023-01-31", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 7302595, "Review Title": "NOT GIVEN", "Review Content": "Having someone build out talk tracks and value adds along with templates that encompass both.\n\n\nThere was nothing I didn't like about my experience with skaled.\n\n\nTake as much as you can and focus on what they teach.\n\n\nSkaled help build out the sequencing portion of our outreach. Made things less manual.", "Publish Date": "2022-11-03", "Author": "Lou L."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 6535771, "Review Title": "NOT GIVEN", "Review Content": "use skaled's services to increase the company's profit percentage, improve the work environment and strengthen customer relations.\n\n\nThe empathy that could be established with my consultant, the disposition with which the ideas and suggestions were developed, the methodology used was easy to execute, the professionalism of the team.\n\n\nThe cost structure of the service is somewhat high for small companies that are starting up, when establishing conversations by mail there were delays in responding.\n\n\nContact a skaled consultant if you wish to improve your sales percentage, your relationship with your customers and expand your customer base.\n\n\nImproved the external and internal environment of the company since a neutral perspective of the situations was obtained, provided strategies to achieve an increase in sales, strengthened ties with customers, provided tools on how to obtain new potential clients.", "Publish Date": "2022-04-22", "Author": "Trey H."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 7019620, "Review Title": "NOT GIVEN", "Review Content": "Skaled was very hands-on and flexible. This helped us tackle a bunch of different problems and get feedback that was helpful and insightful. They were quick to react whenever we had issues, and they helped us better find ways to be successful within our own framework.\n\n\nIt took us a bit to get calibrated on what was the best way to work with Skaled and who was the right key partner to work with us.\n\n\nSkaled is solving the problem of selling a pioneering solution to a typically slow-moving market. They've helped us better understand how to navigate the market and what strategies are more effective in reaching the market.", "Publish Date": "2022-08-22", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 5139693, "Review Title": "NOT GIVEN", "Review Content": "When we initially engaged with Skaled, I was a tech-founder with no sales leadership.  Skaled's consultant Jeb acted as interim Head of Sales.  He helped with everything from onboarding AEs, to running our sales process, to eventually helping us evaluate and hire an amazing VP of Sales.  When necessary,  he would bring in other resources inside of Skaled, such as helping us set up Salesforce.\n\n\nJeb's guidance as we scaled up was really helpful.  As we hit different stages from sorting out processes, to hiring and leveling up processes, Jeb (and the Skaled Team) was able to adapt as our business evolved.\n\n\nI don't think this could have been helped, but the only downside was that because Jeb wasn't full-time (and all the financial benefits that entailed), scheduling would sometimes be challenging.\n\n\nPull the trigger on this service sooner than you think.  It will help you avoid many unanticipated problems.\n\n\nWe were focused on building a repeatable sales process, while confirming product-market fit across a couple of very different markets.  Relying on Skaled's experience meant avoiding many mistakes we would have made without them.", "Publish Date": "2021-11-28", "Author": "Jeremy S."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 5018663, "Review Title": "NOT GIVEN", "Review Content": "Lionel worked with company management to craft a playbook encapsulating current best practices and a strategic path for a successful future.\n\nPrior to kicking off his work with 101edu, he met with all of us individually to better understand our roles, initiatives, and pain points. I've worked with consultants in the past and have never experienced his level of investment and sincere approach.\n\nOn an ongoing basis, I meet with Lionel to finetune my outbound emails, talk track, and overall daily processes. In this capacity, Lionel doesn't come across as a consultant, but a real coach. I look forward to our sessions as I consistently gain new information every time.\n\n\nConsistent support and advice. Relevant feedback. Lionel could always be reached on Slack for additional questions, very reliable.\n\n\nCould have used more one-on-one time. Though I believe that falls under contract terms. Our management should have collaborated sooner to create a playbook.\n\n\nI was not involved with the implementation of Skaled's service, so I can't really speak to that. However, as a sales professional collaborating with our Skaled consultant, my experience has been incredible. I've learned more about advanced sales techniques in the last several months than I have in years. I highly recommend partnering with Skaled.\n\n\nLionel is specifically helping me refine my sales techniques. I've been a sales professional for over a decade and didn't realize that I had slowly fallen into bad habits. Some of my techniques also weren't as current as they should have been. He has helped me improve my email structure and tactics. He's helped me streamline and maximize my phone outreach. He absolutely transformed my LinkedIn profile and taught me everything I now know about using social media to engage prospects.", "Publish Date": "2021-09-24", "Author": "Steven W."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 5162557, "Review Title": "NOT GIVEN", "Review Content": "I started a new sales role with a reasonably new SaaS company. Lisa was assigned to assist the business in developing a roadmap to scaling the sales org, structure, rules of engagement etc...and was tasked with bringing me up to speed as quickly as possible.  She did this through bi-weekly 1:1's, which were very valuable in ramping quickly.\n\n\nAccessibility to Lisa was on point.  The best part was availability and content.  When I had thoughts/ideas/questions, Lisa was always available, and we aligned 100% of the time.\n\n\nThe only part of the engagement I am not a fan of is that it has to end :). Lisa and Skaled were valuable in my transition and valuable to the overall business and sales team.\n\n\nThe biggest problem, in my opinion, was strictly creating the structure for a very green sales organization and helping to build the organization to scale appropriately.", "Publish Date": "2021-11-29", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 4991713, "Review Title": "NOT GIVEN", "Review Content": "Lionel assisted me personally with a project to define our Playbook for our Sales Development Representatives. In addition, we looked at how my team is managed and how I could assist them in becoming a high-performing team.\n\n\nLionel made the outcomes of the mission tangible and understandable and ensure that we worked towards achieving these goals. This way there was never any doubt about the outcome we wanted to achieve and who was doing what to achieve that. Lionel is an insightful leader with a lot of real-life experience. This was not just a textbook exercise.\n\n\nI did not dislike anything during this project.\n\n\nMy team is performing at a much higher level of productivity and output and everyone has clarity around the processes they need to follow.", "Publish Date": "2021-09-07", "Author": "Gus B."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 4990792, "Review Title": "NOT GIVEN", "Review Content": "As an SDR in a start-up, there aren't many processes in place as to how to prospect. So each rep was doing their own thing and trying to find success with that. Hannah from Skaled came in and really took the time to understand what we were doing, what was working, and what wasn't. She provided so much guidance around how to research prospects, the best sequences to use, how to handle objections, and scripts for cold calling. Before Skaled, I was throwing many prospects into my sequence thinking that I could only be successful if I blasted as many people as I could each week. Now I understand the power of personalization and the process behind it so it doesn't seem as impossible and time-consuming anymore. THANK YOU HANNAH!\n\n\nThe SDR playbook that was written by Skaled and my team is now my bible. I look at it anytime I make a phone call or need to write an email to a persona I'm less familiar with. The coaching sessions were also incredibly helpful. It had me thinking about different ways to approach an email or introductory conversation that I had never thought of before.\n\n\nNot every Skaled rep is great. We had used Skaled before and our first rep just didn't mesh well with our team and the second rep was nice but less hands on. So I think it's important to work with the right person at Skaled who can vibe well with your team and speak to them in a way that resonates.\n\n\nWe are solving all things SDR! Our reps are ramping way faster than I did when I joined without using Skaled, so that's been awesome to see!", "Publish Date": "2021-09-07", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 4985277, "Review Title": "NOT GIVEN", "Review Content": "Skaled was tasked with fine-tuning the overall sales process with our SDR team. However, in the process, we received stellar 1x1 coaching, a confidence boost, and what felt like just adding someone to our team. An overall great experience with a great consulant!\n\n\nI liked how easy the connection to build was with my consultant - it's good to work with people you feel genuinely care about your overall long-term accomplishments and are not just there to complete a task. When that is met with great coaching, fantastic attention to detail, and constructive feedback, it's easy to find your footing and excute your sales process better.\n\n\nI honestly didn't have any downsides! 5/5 stars.\n\n\nSkaled was helping my team with our sales process - from mock calls, email writing, targeting your audience better, knowing your customer better, etc. I realized immediate benefits from even the first call regarding my confidence and where my pain points were.", "Publish Date": "2021-09-06", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 5217299, "Review Title": "NOT GIVEN", "Review Content": "Helped understand where we had gaps in terms of processes, systems, training, to put our company in a position to scale faster and keep up with growth.\n\n\nPractical approach, actually think about execution vs. producing guides/etc., that end up never being used once the consultant is gone.  That didn't happen with Skaled, we actually use the work they helped produce and will benefit from it for a long time.\n\n\nCan't say there was anything we disliked.\n\n\nNo problems.  Our team is set up to scale going forward, specifically on processes, systems to support, etc.", "Publish Date": "2021-12-20", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 4980897, "Review Title": "NOT GIVEN", "Review Content": "Skaled partnered with my company to manage our sales team, revamp our sales process, and accelerate growth. Since our partnership with them began, our sales team has had access to a variety of tools and resources to help us be successful.\n\n\nThe best part of Skaled is having constant access to sales expertise. Their team is very hands on. They always have an attack plan to any business challenges that come up. They are very professional and ready to help in any way they can.\n\n\nThere is not much that I dislike about Skaled. If I had to pick one, it would be that my company's contract with them is only temporary.\n\n\nSkaled helps our team solve many different problems. They are constantly breaking down the issues we face and coming up with creative ways to pitch our software to prospects and competitively differentiate ourselves against competitors.", "Publish Date": "2021-09-01", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 4963542, "Review Title": "NOT GIVEN", "Review Content": "I was only a few weeks into role when I was asked to manage the migration and implementation from one SEP to another.  Skaled was our implementation partner and helped quickly get me up to speed along with facilitating the right discussions in our business to help not only with implementation of this SEP, but think about our broader ecosystem.\n\n\nMahak.  Mahak's customer centricity and thoughtfulness in her approach was the key differentiator in why I would turn to Skaled again for any similar projects.  She made herself an indispensible resource to our team and I borderline cried the day I realized that we would not be working together.  No matter how big or small the problem, Mahak was always willing to find a way to help.  We have some legacy things in our Salesforce and very high privacy protocols that made parts of this especially difficult, but Mahak always sought to find an alternative route that would appease all parties.\n\n\nI hated knowing I at some point had to give up working with Mahak!\n\n\nRealized benefit was creating a fairly seamless transition from one SEP to another in ~4 weeks - the fastest implementation our company has done with a new technology.  We needed to migrate to a better, more up to date system and ensure that we create better processes (context is that before we had none) while not causing a ton of friction with the change.  We now are utilizing a much better system for our work and beginning to see better outcomes.", "Publish Date": "2021-08-25", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 4977229, "Review Title": "NOT GIVEN", "Review Content": "Implementation of Outreach\n\n\nOur consultant Neale was excellent throughout the implementation. He was articulate, patient, and willing to go that extra mile to help his client succeed. He even helped us to troubleshoot even weeks after the completion of the initial project.\n\n\nOur consultant was great throughout the implementation of the project.\n\n\nImplementation of Outreach. The vendor didn't provide integration and implementation of its application. Skaled delivers that service to Outreach's new clients. Getting help from a company like Skaled implementing Outreach is a good investment as you want to set it up correctly the first time and train the users to ensure high adaption at the get-go.", "Publish Date": "2021-09-01", "Author": "David S."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 4983887, "Review Title": "NOT GIVEN", "Review Content": "Part of a team of SDRs that received valuable insight and coaching to more cohesively and effectively reach out to prospects through email campaigns and cold calling.\n\n\nLionel took time to understand and empower my personal strengths and to relate the overall goal to my passion and gift set.\n\n\nI would have enjoyed more time collaborating with Lionel as a team alongside all the 1-on-1 coaching.\n\n\nUnified our outgoing messaging to relate the company vision to a variety of personas and target prospects. More confidence going into cold calling and cohesive email campaigns that connect with a variety of professionals.", "Publish Date": "2021-09-02", "Author": "Dan G."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 5018532, "Review Title": "NOT GIVEN", "Review Content": "I recently started as the first Head of Sales for a small organization, and we hired a senior Skaled consultant to help me design our sales program.  She (Lisa Marks) has been nothing short of indispensable for me.  We meet regularly to discuss operational strategy, personnel, and even executive coaching.  She is also helping me write the sales playbook, rules of engagement, and various marketing elements.  I can't say enough about her work and look forward to continuing our partnership.\n\n\nFlexibility access to an amazing consultant.\n\n\nCould use a little more clarity on all services that Skaled can provide.\n\n\nRedesigning the sales process, comp packages, GTM strategy, etc.  We have received executive level, independent third-party thinking, and validation from someone who has done the job previously.", "Publish Date": "2021-09-23", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 4826982, "Review Title": "NOT GIVEN", "Review Content": "Skaled came in and did an audit of our SDR team, came up with recommendations, and worked with our new Global Head of sales to develop a comprehensive playbook and also modify our core systems (Outreach and SFDC).\n\n\nThey had a clear plan, and they worked diligently to execute it.  They kept us in the loop and the incorporated changes on our end due to a new Global Head of Sales.\n\n\nNothing I can really think of. Consulting engagements can always become muddy and vague, bt we nailed the SOW upfront and executed against it.\n\n\nWe needed to get our SDR function firing, and didn't want to wait for the new SDR manager to get it fixed.  They came in, hit the ground running and kept momentum going.", "Publish Date": "2021-06-26", "Author": "Brent P."}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 4837788, "Review Title": "NOT GIVEN", "Review Content": "Developed and implemented a project plan for a new inside sales team.  This included intake of information from key members of the company the sales team would work for, the implementation of technology-primarily Salsforce.com and SalesLoft, and LinkedIn.  Matt managed the project from the beginning with intake meetings, building sales process steps and plan, the sales playbook which includes a tremendous amount of information collected and assembled in the playbook.  He further trained on the playbook contents, LinkedIn, coordinated technology training, and overall did a great job!\n\n\nMatt's communication skills, both written, verbal, and timely are a real asset.\n\n\nThe time between meetings, some of the missed or rescheduled meetings slowed us down, but that goes both ways.  It would have been helpful to have had Salesforce reports developed, tested, and approved before beginning the actual start date of the program.\n\n\nStay engaged and make sure all internal influencers and decision-makers are engaged and accountable for their involvement, evaluation/review, and approval on each phase of the project.\n\n\nProblems solved included lack of resources in our company so need Skaled expertise in key functions to build and implement the team.  Benefits included a faster implementation, useful materials such as the sales playbook, and a model for future implementations.", "Publish Date": "2021-07-01", "Author": "NOT GIVEN"}, {"Product Name": "Skaled", "G2 Link": "https://www.g2.com/products/skaled/reviews", "Review ID": 4984728, "Review Title": "NOT GIVEN", "Review Content": "Skaled came onboard at a turning point in the company's journey. Teams had been reshuffled; leadership was lacking, and with several new joiners, we needed tactical help, expertise and guidance.\n\n\n- Speed to proficiency: the ability to ramp up on critical topics in a matter of hours\n- Empathetic managers: building a human connection with the team was as important as the rest\n\n\nI wish we could have leveraged more industry benchmarks or studies from Skaled helping us understand our performance against that of key industry players\n\n\nProblems: temporary lack of sales leadership, relatively inexperienced workforce, revamped operating model\nBenefits: strong team governance, support & coaching, strategic advice on the overall sales organization, sales quota achievements", "Publish Date": "2021-09-03", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 7634166, "Review Title": "NOT GIVEN", "Review Content": "The best part is their staff who really know their job what to do and when to do with filteres method..The implementation flaw is well designed and well creates and their deep knowledge of market kills us and way they think who to behave when and which market.. determining the current situation..and LeadMD staff where so helpfull to achieve what we looked for.\n\n\nSome of things would be point for them and might be dislike as if there would be monthly retainer option it would so great... weekly update little improvement required ..little visibility require more towards the assigned work..\n\n\nWe suggest all can go for this easily and smooth manner Team to grow their company marketing and planning strategy and also business\n\n\nShift Parasigm is really osam which really help to achieve the goal for our sales and marketing through out the year and also help us for faster result in all aspects ..The most and osam part they setup a marketing environment where we always think and implement about business...Channel manager was appointed to handle also this pain it's osam.", "Publish Date": "2023-01-24", "Author": "Ravi S."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 4824346, "Review Title": "NOT GIVEN", "Review Content": "They helped in promoting the services and in creating a buzz about the brand.\n\n\nInstant support that they provide every time and the kind of features they provide to get the desired results effectively and efficiently.\n\n\nInterface and costing could have been better.\n\n\nIt helped in getting faster and better results in terms of marketing and promotion compared to other resources available in the market.", "Publish Date": "2022-01-10", "Author": "Pranjal M."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 4553072, "Review Title": "NOT GIVEN", "Review Content": "LeadMD helped benefitexpress migrate from HubSpot to Marketing Professional to Marketo Engage. They also assisted in full implementation of Marketo for our environment.\n\n\nGreat people who know their stuff. They set us up for success from the get-go and have provided consultative advice as we transitioned from HubSpot to Marketo. The implementation was flawless and smooth. They are intelligent, and provided us with great leaders in Rachel and Andrew. Mal and Paul are great to bounce ideas off of. Team is great!\n\n\nThere is nothing in my experience that I disliked about working with LeadMD.\n\n\nI would not recommend implementing Marketo without LeadMD to guide you. Unless you are a Marketo expert, it will be a much more challenging experience. Their services were worth every penny.\n\n\nWe needed someone with specific Marketo experience to help us implement. The biggest benefits is the plethora of best practices they set up in our Marketo environment for us to use. From Tag and Channel Management to creating a Center of Excellence, Smart Lists and more. They were always ten steps ahead and thought of things to add to our instance that we would have never even knew we needed.", "Publish Date": "2021-01-13", "Author": "Allison L."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 523399, "Review Title": "NOT GIVEN", "Review Content": "", "Publish Date": "2020-10-13", "Author": "Robert R."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 4553293, "Review Title": "NOT GIVEN", "Review Content": "I've worked with LeadMD on several occasions and they cease to amaze me with all they know. We used them most recently to keep the guardrails on for a very quick (4 week) HubSpot to Marketo migration project. They were flexible with our consulting sessions, always had the right answers, and kept everything organized and on track for us. I would highly recommend them to any company looking to get Marketo up and running with best practices in mind.\n\n\nTheir ability to be adaptive in their approach as well as their deep knowledge of Marketo.\n\n\nI really cannot say that I've disliked one thing about them!\n\n\nWe were trying to ensure a successful migration from HubSpot to Marketo in four weeks and we were able to achieve that!", "Publish Date": "2021-01-13", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 3273058, "Review Title": "NOT GIVEN", "Review Content": "Baseline and offer best practices for current marketo instance and the build and implementation of a new marketo instance.  The combines additional systems from Pardot into Marketo as well.  So we are now working out of 2 instances of marketo vs. 2 instances of Pardot and 1 instance of Marketo.  The Business teams are now aligned to their instances.\n\n\nGreat communication, they have a plan with timelines for all aspects of the project and they are very thorough with determining current state and setting expectations and suggestions on future state.\n\n\nMaybe too many people involved in the process?\n\n\nLet them know what your expectations are, be transparent with them and utilize them as a partner t help you achieve your goals.\n\n\nAs of right now we are expecting a detailed report on areas of opportunity for the current marketo instance.  We've gotten a great detailed plan on the build and implementation of the new marketo instance.", "Publish Date": "2019-09-24", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 3225053, "Review Title": "NOT GIVEN", "Review Content": "They led a Pardot/Marketo migration to Markto project for us.\n\n\nThey were proactive and kept us on task.  We were constantly going out of scope and they kept bringing us back to ensure we met our timeframe.\n\n\nThey were on the more expensive side, but worth it.\n\n\nEnsure you have the scope and costs nailed down in advance.\n\n\nReducing our long term spend while bringing alignment and consistency across marketing.", "Publish Date": "2019-09-30", "Author": "Patricia  N."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 3283948, "Review Title": "NOT GIVEN", "Review Content": "LeadMD help us implement Marketo and tie it to our instance of Salesforce.\n\n\nLeadMD staff were super helpful, patient and did a great job of walking us through the process and explaining why and how things are done in Marketo. Great customer service!\n\n\nI wish there were monthly retainer options that are for few hours each month at a lower rate. That having been said they have been very flexible of working with us.\n\n\nLeadMd has help us to continue to explore ways that we can leverage Marketo and provide support to our sales teams.", "Publish Date": "2019-09-25", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 1769978, "Review Title": "NOT GIVEN", "Review Content": "We used LeadMD for our implementation of Marketo in Q4 2018. They helped with initial set-up, integration with Salesforce, program and campaign design, lead scoring model and program creation, and nurture campaign strategy, migration and design.\n\n\nHow much they cared about our success. The stuck to the scope of work, over-delivered on what was agreed upon and then went above and beyond when we were having issues. When we needed additional hours to help with campaign migration, they worked with our budget and didn't try to oversell or get us more than we needed. Everything they delivered was well documented and they trained us well to ensure we didn't fail. The team we have was phenomenal and truly were all experts at Marketo- there wasn't a problem that they could not solve.\n\n\nAll the major work was done exactly as requested and delivered on time. I would say communicating project status, getting weekly updates and the like is where there could have been improvement. But overall, that didn't impact the project getting completed on time at all.\n\n\nThey are not the cheapest option, but without a doubt they are the most experienced team of Marketo experts you'll find and will not allow their clients to fail or be unsatisfied.", "Publish Date": "2019-02-14", "Author": "Raheel A."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 3348584, "Review Title": "NOT GIVEN", "Review Content": "After doing RFP, we selected LeadMD to set up a brand new Marketo instance for our org. This involved migration of  assets from many different systems onto Marketo on a very tight schedule.\n\n\nVery professional, on-time, committed team\n\n\nNot enough documentation around key decisions, pitfalls, and general lack of visibility around the work\n\n\nCentralized marketing automation system for multiple products", "Publish Date": "2019-10-03", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 2285630, "Review Title": "NOT GIVEN", "Review Content": "They helped us with the audit and restructure of our Marketo instance.\n\n\nThey either always had an answer for us quickly or if not would go find one. They were always willing to help and seemed genuinely interested in our success.\n\n\nAlso have had them do some execution work for us sending emails which has not been as smooth of a process. Unfortunately have had a lot of back and forth and errors on sends.\n\n\nGreat for consulting services, I would be sure to interview whomever is doing execution.\n\n\nMarketing efficiency and effectiveness with our Marketing automation.", "Publish Date": "2019-05-16", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 1837545, "Review Title": "NOT GIVEN", "Review Content": "LeadMD helped us with a hefty migration to Marketo. We had well over 1500 lists, 155 forms, and 300 workflows. We migrated to Marketo in 3 months with no down time.\n\n\nIncredibly professional and knowledgable. A joy to work with and delivered everything listed in the SOW on time and above our expectations.\n\n\nHad an overall good experience, nothing to dislike.\n\n\nNot the least expensive option, but definitely the best!", "Publish Date": "2019-02-26", "Author": "JK S."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 1110134, "Review Title": "NOT GIVEN", "Review Content": "We consulted LeadMD to improve key marketing processes: lead scoring, lead routing, attribution, and reporting.\n\n\nDespite us having a complex business model, LeadMD delivered a truly tailored product and exceeded expectations.  Each team member held incredible depth of knowledge and brought industry best practices to the table.  We knew that they were the experts.\n\nFurthermore, their client facing skills were top notch.  They were flexible in managing our worst impulses, and were extremely tight with any deliverable dates.\n\nLastly along the way, there were some massive operational and strategic shifts on our end that forced the project with LeadMD to change significantly.  To their credit, LeadMD was able to keep up without changing the scope or timeline of the project.\n\n\nThe engagement exceeded expectations.  There were no major hiccups to share.  The team consistently delivered updates and set expectations--as well as follow up with key persons in order head off any stalls.\n\n\nAsk to meet the core execution team as early as possible.", "Publish Date": "2018-11-05", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 886336, "Review Title": "NOT GIVEN", "Review Content": "LeadMD helped us implement nurturing process in our Salesforce utilizing Pardot and Process Builder. They also helped us with the design and implementation of a new Sales Process in our Salesforce.\n\n\nThe working relationship was phenomenal! Everyone is very genuinely concerned about the success of the project. The team went above and beyond when called upon and when asked for help with other system problems. I am thoroughly impressed with the level of customer service provided by Brian Wright, Michael Davis, Katelyn, and Caleb. Everyone was professional and extremely talented at developing rapport and trust.\n\n\nThere wasn't anything I disliked that I could solely blame on LeadMD. I believe responsibilities for the majority for dislikes of collaborative projects, should fall upon all parties and not solely on one.", "Publish Date": "2018-09-20", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 1419447, "Review Title": "NOT GIVEN", "Review Content": "LeadMD assisted us in the implementation to Marketo. They help us set a solid foundation for campaign planning, guided us in our migration, and set us up lead scoring and a lead lifecycle model applicable to our business.\n\n\nWe worked with a knowledgeable team with excellent communication.\n\n\nAt times, it felt the implementation was a bit templated rather than tailored to our specific business, but I understand that this lays the foundation based on their best practices.", "Publish Date": "2018-12-20", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 1180507, "Review Title": "NOT GIVEN", "Review Content": "We're working with the LeadMD on a new partnership to bring Conversational Marketing to their customers. We also plan to have our company's customers use LeadMD for marketing & conversational services.\n\n\nThe team I work with is incredibly hard working and easy to work with.\n\n\nNot much to dislike, we've been working together for a few weeks and have had an incredible experience so far!", "Publish Date": "2018-11-15", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 855857, "Review Title": "NOT GIVEN", "Review Content": "We started working with LeadMD to help us with our Marketo instance, and recently renewed our contract with them.\n\n\nThey are truly an extension of our team. They look at things strategically and will help map out your plan to achieve goals. But they also are very focused on correct implementation - and they are crazy-organized!\n\n\nI consider them best in class. They are a bit pricey, but it's worth it - the ROI is there.", "Publish Date": "2018-08-24", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 580348, "Review Title": "NOT GIVEN", "Review Content": "LeadMD was our trainer for Marketo and email automation.\n\n\nOur trainer and the LeadMD team promised a number of deliverables and, in short, they delivered. It wasn't a hands-off virtual training, that could have easily been given by a number of pre-recorded videos, but an interactive, conversational experience that engaged us.\n\n\nI might suggest, as a learning tool, that the physical control of the tools being taught be turned over to the trainees periodically so that we can also learn by doing in a guided environment.\n\n\nI wish I'd asked more questions, so I would recommend that the trainee teams meet in advance of each session to formulate a list of goals for the session and any questions they might anticipate having.", "Publish Date": "2018-01-23", "Author": "Jordan R."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 565160, "Review Title": "NOT GIVEN", "Review Content": "Our company launched a new Marketo instance in December, and needed consultants to help us get up and running quickly. We also had a limited budget. LeadMD was able to quickly assemble an excellent team that equipped us with customized branded templates, campaign flows, and thorough virtual training.\n\n\nExperience and agility. The team immediately jumped onto our project. Because they know Marketo so well, they were able to adjust the training and setup process to our accelerated schedule. They also jumped in to review our Salesforce sync which happened after our engagement ended.\n\n\nCost is high. Fortunately we were able to fit an engagement within our budget, but it would be helpful to have a better sense of the total cost and ways we could reduce that.\n\n\nAsk lots of questions. They know their stuff, but if you aren't experienced in marketing automation, learn what you need to know.", "Publish Date": "2018-01-16", "Author": "Andrew S. C."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 504276, "Review Title": "NOT GIVEN", "Review Content": "We've worked with LeadMD on several projects including ongoing marketing automation optimization, marketing and sales strategy, marketing and sales alignment, database cleanup and support, and database strategy.\n\n\nAs a small business, we rely on LeadMD as an extension of our team. They've taken the time to understand not only our marketing and sales challenges, but our challenges as an organization. The LeadMD team is knowledgeable, responsive, organized, and easy to work with. They are very good at setting expectations and timelines to keep projects running smoothly.\n\n\nWith limited budget and internal bandwidth, it was difficult to prioritize projects and move at a fast pace when we first started working with LeadMD. They have done a great job keeping us on track this year!\n\n\nHighly recommend for all things marketing and sales related! Their expertise in Marketo, Salesforce, and business strategy is invaluable.", "Publish Date": "2017-12-14", "Author": "Kelsey T."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 485452, "Review Title": "NOT GIVEN", "Review Content": "We hired LeadMD for Marketo implementation. LeadMD was introduced to us during the Marketo sales process.\n\n\nLeadMD is definitely on point with organization and communication. Our project ran like a well-oiled machine. After some misalignment on our initial SOW and deliverables, LeadMD worked with us on a remediation plan that exceeded our expectations.\n\n\nEarly in the project, we felt like we were forced into the LeadMD box rather than LeadMD tailoring the deliverables around our unique business outcomes. This led to some unmet expectations and frustration on our part. However, as mentioned above, LeadMD worked with us to ensure we got the value we needed out of our investment/engagement with them.\n\n\nMake sure the SOW aligns with your business outcomes from the outset to prevent misalignment.", "Publish Date": "2017-12-04", "Author": "Justin Y."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 634445, "Review Title": "NOT GIVEN", "Review Content": "We need a outside assessment of our current demand management across process, technology, and data with eye towards shifting to a Account Based Demand Model.\n\n\nThe team assigned was very knowledge\nThe on ramping process was excellent\nThe follow up and project management was very good\n\n\nJust trying to find time to start the project with the right consultants was the biggest challenge, but it wasn't a substantial delay.\n\n\nLeadMd has been around from the beginning and provides substantial expertise across marketing automation, CRM-Salesforce, and Demand management process development.", "Publish Date": "2018-02-28", "Author": "C. Edward B."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 518640, "Review Title": "NOT GIVEN", "Review Content": "I love working with LeadMD. They're responsive, easy to work with and understand, and absolute experts in their field.\n\n\nOrganized, easy to work with, documentation all along the way.\n\n\nIf I had to dislike something, I could say the price, but I don't think that's fair. Of the partners we reviewed, they came in the highest but we picked them because there is no one better to work with.\n\n\nKeep up to date with your Box account. Much gets added to it and you might get lost. But it's all valuable information and useful all along the way.", "Publish Date": "2017-12-22", "Author": "Cole E."}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 336546, "Review Title": "NOT GIVEN", "Review Content": "LeadMD helped us progress our marketing maturity via a full Marketo/Salesforce health check, Lead Lifecycle deployment (including Lead Scoring, Nurturing, Reporting), Database cleanup, Email Marketing, Campaign set up and template optimization.\n\n\nI have worked with many agencies and consulting firms in my 22+ years in B2B marketing and LeadMD stands out as the best. They are a true extension of my marketing team and play an active role in our success as a late stage startup. They also have exceptional project management processes that keep us on track.\n\n\nWe had a few hiccups with project implementation --- primarily do to a lack of process documentation for key stakeholders outside of marketing. The LeadMD team acknowledged this and developed documentation as soon as this was identified as a critical need.", "Publish Date": "2018-01-25", "Author": "NOT GIVEN"}, {"Product Name": "Shift Paradigm", "G2 Link": "https://www.g2.com/products/shift-paradigm/reviews", "Review ID": 506548, "Review Title": "NOT GIVEN", "Review Content": "LeadMD has helped us establish multiple workflows within Marketo.  They helped us with lead scoring, RCM - lead lifecycle, campaign design, data cleanup, etc.  They are truly an extension of my small team and we wouldn't be where we are today without them.  When it comes to planning, organizing, and executing projects, they are exceptional!\n\n\nI love that they are always there to lend a hand or talk to if a problem arises!\n\n\nNot enough hours in a month to fulfill all initiatives.  We have several on backlog that I'd love to get to!\n\n\nNeed help with an initiative that you have no time to get off the ground floor?  LeadMD should be your first choice for help! They will plan, organize, and execute for you and provide all documentation needed.  Great resource and asset!", "Publish Date": "2017-12-15", "Author": "Brittney Z."}]