{
    "data": {
        "product_id": 22537,
        "product_name": "Anvil Media",
        "product_logo": "https://images.g2crowd.com/uploads/product/image/large_detail/large_detail_9ec9c15515f45c9a976c611b640ad730/anvil-media.jpg",
        "g2_link": "https://www.g2.com/products/anvil-media/reviews",
        "what_is": "Anvil Media offers a full set of integrated services to help our clients succeed in the constantly evolving digital landscape. We maximize exposure, engagement, and conversion by optimizing websites, developing paid media and social media strategies, building or redesigning websites, and offering guidance on branding. You can count on us to be your Most Valued Partner.\n\nDigital Marketing Services\n\nPaid Media Services: paid media strategy and planning, paid media management, paid media reporting and analytics, and paid media audits and plans (Anvil Marketing Index Scorecard(tm), Anvil Marketing Index Snapshot(tm), conversion rate optimization audit and plan, competitive intelligence audit, amazon shopping audit and plan, paid media plan, and landing page audit), and ongoing paid media services (Anvil Marketing Program(tm) and customized ongoing paid media management).\n  \nSearch Engine Optimization Services: search engine optimization (SEO), SEO management and reporting, SEO audits and plans (Anvil Marketing Index Scorecard(tm), Anvil Marketing Index Snapshot(tm), conversion rate optimization audit and plan, keyword audit and plan, local search audit and plan, search authority audit and plan, site optimization audit and plan, voice search optimization strategy, and web analytics audit and plan), and ongoing SEO (Anvil Marketing Program(tm) and customized ongoing SEO engagement).\n\nSocial Media Services: social media research, social media marketing strategy and planning, and social media marketing management and reporting.\n\nContent Marketing Services: content marketing audit and plan and program launch and management.\n\nWeb Analytics Services: analytics strategy and planning, including data accuracy, custom reporting and dashboards, ecommerce tracking, goal setup, internal site search, multi-channel funnels, and regular reporting on site and campaign performance.\n\nWebsite Development Services: our primary web design goal is to clearly communicate your brand promise while creating an experience that is intuitive and refreshing for your audience. \n\nAnvil Marketing Program(tm): the AMP(tm) uses organic search, paid media, and social media to amplify quality content and this in turn leads to increased brand awareness, deeper engagement, increased conversions, and higher brand loyalty.",
        "product_description": "Anvil is a marketing agency that specializes in search engine marketing, social media and analytics.",
        "positioning_against_competitor": null,
        "rating": 4.8,
        "reviews": 3,
        "company_id": 18171,
        "seller": "Anvil Media",
        "company_phone": null,
        "company_location": "Portland, OR",
        "company_founded_year": 2000,
        "company_annual_revenue": null,
        "company_ownership": null,
        "discussions_link": "https://www.g2.com/products/anvil-media/discuss",
        "supported_languages": "English",
        "twitter": "https://twitter.com/anvilmedia",
        "number_of_followers_on_twitter": 4775,
        "linkedin": "https://www.linkedin.com/company/anvil-media-inc-",
        "number_of_employees_on_linkedin": 9,
        "product_website": null,
        "company_website": null,
        "is_claimed": true,
        "categories": [
            {
                "category_name": "SEO Services",
                "category_link": "https://www.g2.com/categories/seo-services"
            },
            {
                "category_name": "Content Marketing Agencies",
                "category_link": "https://www.g2.com/categories/content-marketing-agencies"
            },
            {
                "category_name": "Social Media Marketing (SMM) Companies",
                "category_link": "https://www.g2.com/categories/social-media-marketing-smm-companies"
            },
            {
                "category_name": "PPC Services",
                "category_link": "https://www.g2.com/categories/ppc-services"
            },
            {
                "category_name": "WordPress Developers",
                "category_link": "https://www.g2.com/categories/wordpress-developers"
            }
        ],
        "videos": [],
        "download_links": [],
        "pricing_plans": null,
        "alternatives": [
            {
                "competitor_name": "The Free Website Guys",
                "competitor_link": "https://www.g2.com/products/the-free-website-guys/reviews",
                "competitor_rating": 4.9,
                "competitor_reviews": 673
            },
            {
                "competitor_name": "KlientBoost",
                "competitor_link": "https://www.g2.com/products/klientboost/reviews",
                "competitor_rating": 4.8,
                "competitor_reviews": 345
            },
            {
                "competitor_name": "DashClicks",
                "competitor_link": "https://www.g2.com/products/dashclicks/reviews",
                "competitor_rating": 4.7,
                "competitor_reviews": 212
            },
            {
                "competitor_name": "webdew",
                "competitor_link": "https://www.g2.com/products/webdew/reviews",
                "competitor_rating": 4.9,
                "competitor_reviews": 188
            },
            {
                "competitor_name": "WebFX",
                "competitor_link": "https://www.g2.com/products/webfx/reviews",
                "competitor_rating": 4.9,
                "competitor_reviews": 176
            },
            {
                "competitor_name": "SmartSites",
                "competitor_link": "https://www.g2.com/products/smartsites/reviews",
                "competitor_rating": 4.9,
                "competitor_reviews": 165
            }
        ],
        "comparisons": [],
        "star_distribution": {
            "1": 0,
            "2": 0,
            "3": 0,
            "4": 0,
            "5": 3
        },
        "g2_reviews_link": "https://www.g2.com/products/anvil-media/reviews#reviews",
        "initial_reviews": [
            {
                "review_id": 7676166,
                "review_title": "A Digital Marketing and Advertising Agency",
                "review_content": "What do you like best about Anvil Media?\nAnvil Media has a thorough understanding of digital marketing and provides effective solutions to its clients. Anvil Media offers a full range of digital marketing services, including SEO, PPC, social media marketing, and web analytics, offering a complete solution for its clients' needs. The company adopts a data-driven and result-oriented approach, using metrics and analytics to track the success of its campaigns and continually enhance its performance.\n\nWhat do you dislike about Anvil Media?\nDigital marketing services can be costly, and some small businesses may struggle to allocate sufficient funds to these efforts. Effective digital marketing requires a comprehensive understanding of different technologies, platforms, and methods, and some companies may not possess the required expertise internally.\n\nWhat problems is Anvil Media solving and how is that benefiting you?\nAnvil Media is a digital marketing firm that specializes in services such as search engine optimization (SEO), pay-per-click advertising (PPC), social media marketing, and web analytics",
                "review_rating": 4.5,
                "reviewer": {
                    "reviewer_name": "Mehul J.",
                    "reviewer_job_title": "Mechanical Engineer",
                    "reviewer_link": "https://www.g2.com/users/726bd772-d4ff-4afc-a4b1-a91b9f4a6fdb"
                },
                "publish_date": "2023-02-07",
                "reviewer_company_size": "Small-Business(50 or fewer emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/anvil-media/reviews/anvil-media-review-7676166"
            },
            {
                "review_id": 4443447,
                "review_title": "Outstanding Website development during Covid-19 pandemic",
                "review_content": "Describe the project or task Anvil Media helped with:\nForest Grove Tourism contracted with Anvil Media to provide a new Website and  two new Social Media Channels for us.  Our goal was to develop a Destination image for the area of Forest Grove, Oregon as a Tourism location of 1st choice!\n\nWhat do you like best about Anvil Media?\nThey are so good, I was happy to be included in their busy schedule!  They have been totally flexible with us during this time of turmoil in the Tourism industry. We have had to delay our project slightly multiple times and they rolled with the punches we threw at them! Their staff is very professional, and responsive when needed.\n\nWhat do you dislike about Anvil Media?\nHaving worked with them before, I can assure you, our Tourism Advisory Committee wouldn't have chosen them without their being the very best we could find!  As a smaller client, with a minimal budget, they showed they cared for our project as much as any other.\n\nWhat problems is Anvil Media solving and how is that benefiting you?\nDestination recognition for an Historic, but little recognized Tourism Destination on a regional basis.  Still in development process for our final draft of the Website and Social Channels.",
                "review_rating": 5,
                "reviewer": {
                    "reviewer_name": "Courtland C.",
                    "reviewer_job_title": "Tourism Director/Consultant",
                    "reviewer_link": "https://www.g2.com/users/9bafe0c8-e976-465f-b502-c17425307322"
                },
                "publish_date": "2020-10-28",
                "reviewer_company_size": "Small-Business(50 or fewer emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/anvil-media/reviews/anvil-media-review-4443447"
            },
            {
                "review_id": 242621,
                "review_title": "Anvil = Power Partner!",
                "review_content": "Describe the project or task Anvil Media helped with:\nWe've worked with a handful and digital marketing specialists to drive awareness and attendance for our events, and just weren't getting results.  We tried one last-ditch effort with Anvil -- they quickly understood my business, my challenges and the misconceptions that can surface regarding the industry.  The wordings/language in our online markets produced RESULTS = registrations and attendance.  I will continue using Anvil - and only Anvil - for our digital marketing.\n\nWhat do you like best about Anvil Media?\nAnvil has been a fantastic partner -- I'm continuously impressed by their high level of competence, ability to report data-driven information in a clear and concise manner, and be so darn personable! \n\nThey are highly responsive and monitored all our digital marketing campaigns closely, knowing how/when/where to allocate our marketing budget for the most impactful return.  There is a high level of transparency with Anvil and I have already referred them to my parent company.  I encourage my colleagues nationwide to use their services.\n\nWhat do you dislike about Anvil Media?\nMy only regret is that I didn't have more marketing budget for them!",
                "review_rating": 5,
                "reviewer": {
                    "reviewer_name": "Emily A.",
                    "reviewer_job_title": "Director of Business Development and Franchise Consultant",
                    "reviewer_link": "https://www.g2.com/users/433e4983-6ab0-4573-9f30-f8c3bdd5dd81"
                },
                "publish_date": "2017-02-17",
                "reviewer_company_size": "Mid-Market(51-1000 emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/anvil-media/reviews/anvil-media-review-242621"
            }
        ]
    },
    "error": null
}