{
    "data": {
        "product_id": 25235,
        "product_name": "Crayon",
        "product_logo": "https://images.g2crowd.com/uploads/product/image/large_detail/large_detail_fdbe03eb1ac8b85469df2fc9ac7497f0/crayon.png",
        "g2_link": "https://www.g2.com/products/crayon/reviews",
        "what_is": "Crayon is expert at optimizing client ROI from complex technology.",
        "product_description": null,
        "positioning_against_competitor": null,
        "reviews": 11,
        "rating": 4.4,
        "medal_image": null,
        "company_id": 20141,
        "seller": "Crayon A/S",
        "company_phone": null,
        "company_location": "Oslo, Norway",
        "company_founded_year": 2002,
        "company_annual_revenue": null,
        "total_revenue_usd_mm": null,
        "company_ownership": null,
        "discussions_link": "https://www.g2.com/products/crayon/discuss",
        "supported_languages": null,
        "twitter": "https://twitter.com/CrayonIT",
        "number_of_followers_on_twitter": 2482,
        "linkedin": "https://www.linkedin.com/company/crayon-group/",
        "number_of_employees_on_linkedin": 3303,
        "product_website": null,
        "company_website": null,
        "is_claimed": true,
        "categories": [
            {
                "category_name": "AWS Consulting Services",
                "category_link": "/categories/aws-consulting-services"
            },
            {
                "category_name": "ServiceNow Consulting Services",
                "category_link": "/categories/servicenow-consulting-services"
            },
            {
                "category_name": "Adobe Channel Partners",
                "category_link": "/categories/adobe-channel-partners"
            }
        ],
        "screenshots": [],
        "videos": [],
        "download_links": [],
        "pricing_plans": null,
        "alternatives": [
            {
                "competitor_name": "Accenture",
                "competitor_link": "/products/accenture/reviews",
                "competitor_rating": 4,
                "competitor_reviews": 102
            },
            {
                "competitor_name": "CDW Hardware",
                "competitor_link": "/products/cdw-hardware/reviews",
                "competitor_rating": 4,
                "competitor_reviews": 27
            },
            {
                "competitor_name": "Deloitte Consulting",
                "competitor_link": "/products/deloitte-consulting/reviews",
                "competitor_rating": 4,
                "competitor_reviews": 63
            },
            {
                "competitor_name": "IBM Consulting",
                "competitor_link": "/products/ibm-consulting/reviews",
                "competitor_rating": 4,
                "competitor_reviews": 62
            },
            {
                "competitor_name": "Cognizant",
                "competitor_link": "/products/cognizant/reviews",
                "competitor_rating": 4,
                "competitor_reviews": 40
            },
            {
                "competitor_name": "Navisite Services",
                "competitor_link": "/products/navisite-services/reviews",
                "competitor_rating": 4,
                "competitor_reviews": 34
            }
        ],
        "comparisons": [],
        "star_distribution": {
            "1": 0,
            "2": 0,
            "3": 0,
            "4": 5,
            "5": 6
        },
        "g2_reviews_link": "https://www.g2.com/products/crayon/reviews#reviews",
        "initial_reviews": [
            {
                "review_id": 8213152,
                "review_title": "NOT GIVEN",
                "review_content": "The team assessed our company initially on how to make the process and the benefits it'll bring us. The team was very friendly and answered patiently our questions timely.\n\n\nThe company was very impressed with Crayon and they had no objections. Plus they needed to start cloud storing for the company's requirements. I would say maybe more presence of Latin companies in the rooster or perhaps offices in Latam to secure more presence in the Latin market if that's something they're interested in.\n\n\nHave IT people to reach out to them and explain in detail the processes, don't ask people that are not familiar with the jargon or with basic knowledge to meet with them because they'll end up confused, it's extra work for you and them as well.\n\n\nMoving to a cloud storage model in the company I used to work with, with Crayon we're assessed on how to make the transition and we're actually recommended by a colleague in Croatia from another branch that used Crayon.",
                "review_rating": 4.5,
                "reviewer": {
                    "reviewer_name": "Neyla Vanessa P.",
                    "reviewer_job_title": "Administrative Assistant to VP of Engineering",
                    "reviewer_link": "https://www.g2.com/users/9725ca94-b4ab-4d36-820d-fe68d5815abf"
                },
                "publish_date": "2023-06-13",
                "reviewer_company_size": "Small-Business(50 or fewer emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/crayon/reviews/crayon-review-8213152"
            },
            {
                "review_id": 8278891,
                "review_title": "NOT GIVEN",
                "review_content": "The way Crayon's digital expert trained to onboard the latest versions is exterely professional without wasting the time of our resources and helped us to stay a step ahead.\n\n\nThe suite of offers is very limited and dependent on another third party for their offerings. So the knowledge base are platform dependent and builds a dependency.\n\n\nGive it a try!\n\n\nWe can manage your teams digital transformation journey by partnering with the experts from Crayon, who are extremely helpful when exploring new features when ever a new release is there.",
                "review_rating": 4.5,
                "reviewer": {
                    "reviewer_name": "Anish Kumar  D.",
                    "reviewer_job_title": "Specialist",
                    "reviewer_link": "https://www.g2.com/users/e7ab2aa9-5553-420f-a947-8128f1aee998"
                },
                "publish_date": "2023-07-03",
                "reviewer_company_size": "Small-Business(50 or fewer emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/crayon/reviews/crayon-review-8278891"
            },
            {
                "review_id": 7665356,
                "review_title": "NOT GIVEN",
                "review_content": "I do not have to spend much time researching a specific topic to gain the information, as I can use Crayon to get the information in a short amount of time, and it is also very easy to search for the information I am looking for without much hassle.\n\n\nI can not think of anything that I dislike about Crayon because it got all the features that are required and it does the job for me perfectly without an issue.\n\n\nIf you are looking for a tool that provides information about your industry competitors, then this is a must-have tool in your system and this also won't take much time to get the information\n\n\nWe use Crayon to gather much indeed information and the latest news about the competitors in the industry, along with that we also use different solutions provided by Crayon such as Adobe Acrobat",
                "review_rating": 4.0,
                "reviewer": {
                    "reviewer_name": "Rupesh K.",
                    "reviewer_job_title": "DevOps Engineer",
                    "reviewer_link": "https://www.g2.com/users/9533e2ef-2f85-4a5b-949d-2f966ade39ff"
                },
                "publish_date": "2023-02-02",
                "reviewer_company_size": "Enterprise(> 1000 emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/crayon/reviews/crayon-review-7665356"
            },
            {
                "review_id": 8265002,
                "review_title": "NOT GIVEN",
                "review_content": "Their services are very much based on all the new technology like cloud and analytics, which use AI and reliable data. Their customer support and onboarding process is smooth\n\n\nI think Crayon should look at how they can onboard more social media platforms, like LinkedIn. Even their emails about various insights re good but can be made better\n\n\nCrayon has good products and services to help businesses transform into digital businesses. Their cloud-based approach helps users/on boarders to embrace the new technology of today seamlessly",
                "review_rating": 4.0,
                "reviewer": {
                    "reviewer_name": "NOT GIVEN",
                    "reviewer_job_title": "NOT GIVEN",
                    "reviewer_link": "NOT GIVEN"
                },
                "publish_date": "2023-06-28",
                "reviewer_company_size": "Small-Business(50 or fewer emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/crayon/reviews/crayon-review-8265002"
            },
            {
                "review_id": 7657663,
                "review_title": "NOT GIVEN",
                "review_content": "Their team's competence and their services.\nCrayon's staff has unparalleled skills and experience in offering technology and digital transformation solutions.\n\n\nTo the best of my knowledge, there are none.\nBecause it can be tailored to meet the specific requirements of each customer, Crayon is an excellent choice for any corporate transformation solution.\n\n\nIf you're looking for a digital transformation solution that's grounded on actual data, Crayon is the business for you. They concentrate on generating genuine outcomes for their clients and adopt a results-driven strategy.\n\n\nTheir services include IT strategy consulting, cloud computing, digital experience design, and more.\nCrayon differentiates itself from other technology and digital transformation organizations by emphasizing tangible outcomes. They emphasize results-driven customer value.",
                "review_rating": 5.0,
                "reviewer": {
                    "reviewer_name": "Godfrey C.",
                    "reviewer_job_title": "Technical Quality Manager",
                    "reviewer_link": "https://www.g2.com/users/56aa1cc8-67b0-434c-ab51-49f2907c34ad"
                },
                "publish_date": "2023-01-31",
                "reviewer_company_size": "Mid-Market(51-1000 emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/crayon/reviews/crayon-review-7657663"
            },
            {
                "review_id": 7655670,
                "review_title": "NOT GIVEN",
                "review_content": "It is stable and great platform, no downtime encounterd. Drafting, publishing, and sharing intelligence with our internal team is simple. It's great toold and support team is excellent.\n\n\nThis is really amazing using crayon and nothing to dislike. Sometimes this tool is buggy and hanging and nothing else. Else everything looks and works fine for me.\n\n\nI appreciate that the crayon support team and our customer service representative rapidly address any questions I have. And it assists us grasp what we are lacking or record a suggestion for a future products improvement.",
                "review_rating": 5.0,
                "reviewer": {
                    "reviewer_name": "NOT GIVEN",
                    "reviewer_job_title": "NOT GIVEN",
                    "reviewer_link": "NOT GIVEN"
                },
                "publish_date": "2023-01-31",
                "reviewer_company_size": "Small-Business(50 or fewer emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/crayon/reviews/crayon-review-7655670"
            },
            {
                "review_id": 5337915,
                "review_title": "NOT GIVEN",
                "review_content": "We use Crayon to provide competitive intelligence to our teams automatically. This information allows us to identify opportunities in which we can exploit competitive advantages or differentiate our products and services from the competition,\n\n\nI like that this information is delivered to my inbox automatically. I don't need to visit a page or mine the data continually. It comes to my inbox on a regular schedule so that I can act on the data quickly.\n\n\nNeeds more robust how-to documentation on how to use various features. Especially recommendations around best practices.  I would also like to see some more advanced analytics capabilities in Crayon. Finally, it's tough getting some teams to review and act on the information. This problem is not a Crayon issue but indeed a cautionary tale for anyone considering incorporating competitive intelligence into their organization. Make sure that review and action become part of the normal process.\n\n\nMake sure that you have a process in place to have the team regularly review and act on the information.\n\n\nOur organization is using Crayon to get competitive intelligence into the hands of our teams quicker and more efficiently than if they were mining the information on their own. We've been able to respond to changes in the marketplace more quickly and have much more detailed battle cards available to our sales team.",
                "review_rating": 4.0,
                "reviewer": {
                    "reviewer_name": "Mike M.",
                    "reviewer_job_title": "VP of Product",
                    "reviewer_link": "https://www.g2.com/users/fc120a48-8689-46ee-a835-87f95424d7e5"
                },
                "publish_date": "2022-02-22",
                "reviewer_company_size": "Mid-Market(51-1000 emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/crayon/reviews/crayon-review-5337915"
            },
            {
                "review_id": 6735075,
                "review_title": "NOT GIVEN",
                "review_content": "easy to use/ can search and easily find anything\n\n\nHonestly i cant think of any- we enjoy the tool\n\n\nif you want a simple tool for everyone to understand this is it\n\n\nyou can easily search for anything- my sales team faces objections and can find the answers within seconds- very simple tool",
                "review_rating": 5.0,
                "reviewer": {
                    "reviewer_name": "Haley D.",
                    "reviewer_job_title": "Senior Account Executive",
                    "reviewer_link": "https://www.g2.com/users/78b2218e-4f6b-46ba-8ffa-496b4023ae72"
                },
                "publish_date": "2022-06-14",
                "reviewer_company_size": "Mid-Market(51-1000 emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/crayon/reviews/crayon-review-6735075"
            },
            {
                "review_id": 4952069,
                "review_title": "NOT GIVEN",
                "review_content": "When I am on a work call - and a client says they are looking at our competitors - I know how to position my calls because of Crayon. It has all the information I need to know about our competitors all in one spot. It shows me what I should talk about on my calls for each competitor.\n\n\nI like that I can find information about our competitors so quickly. I don't have to do a ton of research because it is all right there.\n\n\nThere isn't anything I dislike in Crayon. I can do everything I need to in the system.\n\n\nIf you don't have a spot for your employees to view information about your competitors - then this is a great system for you!\n\n\nBefore Crayon - it was taking me so much time to find information about our competitors. The most significant benefit of Crayon is that I am saving so much time. I also know how to position my calls because of Crayon.",
                "review_rating": 4.0,
                "reviewer": {
                    "reviewer_name": "NOT GIVEN",
                    "reviewer_job_title": "NOT GIVEN",
                    "reviewer_link": "NOT GIVEN"
                },
                "publish_date": "2021-09-08",
                "reviewer_company_size": "Mid-Market(51-1000 emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/crayon/reviews/crayon-review-4952069"
            },
            {
                "review_id": 5003003,
                "review_title": "NOT GIVEN",
                "review_content": "It's helping us gather competitive intel and news happening in our industry. It is also pushing in real-time sentiment from G2\n\n\nI like that it surfaces relevant content for us and allows us to share intel we are hearing from our prospects\n\n\nWe have a lot of content in Highspot that can be pushed to salesforce automatically depending on the competitor we are facing. So there is no benefit to have an additional tool to cover competitive intel when we have battles cards and decks built out in Highspot for ammo\n\n\nWe didn't have a problem strategizing on competitive",
                "review_rating": 3.5,
                "reviewer": {
                    "reviewer_name": "NOT GIVEN",
                    "reviewer_job_title": "NOT GIVEN",
                    "reviewer_link": "NOT GIVEN"
                },
                "publish_date": "2021-09-15",
                "reviewer_company_size": "Enterprise(> 1000 emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/crayon/reviews/crayon-review-5003003"
            },
            {
                "review_id": 4702155,
                "review_title": "NOT GIVEN",
                "review_content": "I work in sales and understanding the competitive landscape is crucial.\n\n\nI like how quickly I can find the information that I am looking for.\n\n\nIt requires an admin to keep the info updated, so sometimes I have to be cautious about the info that I gather from the tool.\n\n\nI am solving the problem of being able to speak confidently about how my product differs from that of the competition. I am able to show up to calls prepared with how our product is superior and speak to the nuances of our product vs. another solution.",
                "review_rating": 5.0,
                "reviewer": {
                    "reviewer_name": "NOT GIVEN",
                    "reviewer_job_title": "NOT GIVEN",
                    "reviewer_link": "NOT GIVEN"
                },
                "publish_date": "2021-09-09",
                "reviewer_company_size": "Mid-Market(51-1000 emp.)",
                "is_video_review": false,
                "review_link": "https://www.g2.com/products/crayon/reviews/crayon-review-4702155"
            }
        ]
    },
    "error": null
}